import{_ as r}from"./_plugin-vue_export-helper.cdc0426e.js";import{o as a,c as o,a as e,d as n,b as d,e as s,r as l}from"./app.105792af.js";const t="/assets/1706916-20211206140410951-1343563081.54b37ca4.png",c="/assets/1706916-20211206140411698-1715972721.51316da4.png",p="/assets/1706916-20211206140412029-105986018.1eba65db.png",v="/assets/1706916-20211206140412266-1836103829.06320ca4.png",u="/assets/1706916-20211206140412558-1896365057.20bb8bbb.png",m="/assets/1706916-20211206140412794-1931619110.f7d0af52.png",h="/assets/1706916-20211206140413060-472933950.49e023e3.png",b="/assets/1706916-20211206140413364-1750508135.e92976a9.png",g="/assets/1706916-20211206140413635-1651212569.cbf7cf14.png",_="/assets/1706916-20211206140413895-598086200.398f47c3.png",x="/assets/1706916-20211206140414167-1597880036.785ab9b2.png",E="/assets/1706916-20211206140414422-46904758.04b6c5a2.png",C="/assets/1706916-20211206140414660-1905341790.e5b6c7dc.png",T="/assets/1706916-20211206140414925-205713197.65c1be90.png",R="/assets/1706916-20211206140415154-2051418698.65402495.png",y="/assets/1706916-20211206140415390-1470686790.a0555978.png",A="/assets/1706916-20211206140415664-1006393666.ab005f5c.png",N="/assets/1706916-20211206140415921-350969977.055910f3.png",f="/assets/1706916-20211206140416199-2067396295.30ba7661.png",I="/assets/1706916-20211206140416454-837132489.f66c6f29.png",M="/assets/1706916-20211206140416730-1445399151.9fe754dd.png",S="/assets/1706916-20211206140417013-1622746384.803bddf1.png",j="/assets/1706916-20211206140417295-4097130.28552517.png",D="/assets/1706916-20211206140417615-1727996097.60259b18.png",k={},H=e("h2",{id:"neo4j\u4E2D\u6587\u6587\u6863-\u5165\u95E8\u6307\u5357",tabindex:"-1"},[e("a",{class:"header-anchor",href:"#neo4j\u4E2D\u6587\u6587\u6863-\u5165\u95E8\u6307\u5357","aria-hidden":"true"},"#"),n(" neo4j\u4E2D\u6587\u6587\u6863-\u5165\u95E8\u6307\u5357")],-1),O={href:"https://www.cnblogs.com/wheaesong/p/15649547.html#/c/subject/p/15649547.html",target:"_blank",rel:"noopener noreferrer"},P=e("h3",{id:"neo4j-v4-4",tabindex:"-1"},[e("a",{class:"header-anchor",href:"#neo4j-v4-4","aria-hidden":"true"},"#"),n(" Neo4j v4.4")],-1),q={href:"https://neo4j.com/docs/license/",target:"_blank",rel:"noopener noreferrer"},U=e("h4",{id:"neo4j",tabindex:"-1"},[e("a",{class:"header-anchor",href:"#neo4j","aria-hidden":"true"},"#"),n(),e("strong",null,"neo4j")],-1),L=e("p",null,"Neo4j \u662F\u4E16\u754C\u9886\u5148\u7684\u56FE\u5F62\u6570\u636E\u5E93\u3002\u8BE5\u67B6\u6784\u65E8\u5728\u4F18\u5316\u7BA1\u7406\u3001\u5B58\u50A8\u548C\u904D\u5386\u8282\u70B9\u548C\u5173\u7CFB\u3002\u56FE\u6570\u636E\u5E93\u91C7\u7528\u5C5E\u6027\u56FE\u65B9\u6CD5\uFF0C\u8FD9\u5BF9\u904D\u5386\u6027\u80FD\u548C\u64CD\u4F5C\u8FD0\u884C\u65F6\u90FD\u6709\u597D\u5904\u3002",-1),G=e("h4",{id:"cypher",tabindex:"-1"},[e("a",{class:"header-anchor",href:"#cypher","aria-hidden":"true"},"#"),n(" **Cypher **")],-1),F=e("p",null,"Cypher \u662F Neo4j \u7684\u56FE\u5F62\u67E5\u8BE2\u8BED\u8A00\uFF0C\u5141\u8BB8\u7528\u6237\u4ECE\u56FE\u5F62\u6570\u636E\u5E93\u4E2D\u5B58\u50A8\u548C\u68C0\u7D22\u6570\u636E\u3002\u5B83\u662F\u4E00\u79CD\u58F0\u660E\u5F0F\u7684\u3001\u53D7 SQL \u542F\u53D1\u7684\u8BED\u8A00\uFF0C\u7528\u4E8E\u4F7F\u7528 ASCII \u827A\u672F\u8BED\u6CD5\u63CF\u8FF0\u56FE\u5F62\u4E2D\u7684\u89C6\u89C9\u6A21\u5F0F\u3002\u8BED\u6CD5\u63D0\u4F9B\u4E86\u4E00\u79CD\u89C6\u89C9\u548C\u903B\u8F91\u65B9\u5F0F\u6765\u5339\u914D\u56FE\u4E2D\u8282\u70B9\u548C\u5173\u7CFB\u7684\u6A21\u5F0F\u3002Cypher \u65E8\u5728\u8BA9\u6BCF\u4E2A\u4EBA\u90FD\u6613\u4E8E\u5B66\u4E60\u3001\u7406\u89E3\u548C\u4F7F\u7528\uFF0C\u800C\u4E14\u8FD8\u878D\u5408\u4E86\u5176\u4ED6\u6807\u51C6\u6570\u636E\u8BBF\u95EE\u8BED\u8A00\u7684\u5F3A\u5927\u529F\u80FD\u3002",-1),w=e("p",null,[e("strong",null,"\u672C\u6307\u5357\u7684\u5185\u5BB9")],-1),V=e("p",null,"Neo4j \u5165\u95E8\u6307\u5357\u6DB5\u76D6\u4EE5\u4E0B\u9886\u57DF\uFF1A",-1),W={href:"https://neo4j.com/docs/getting-started/current/get-started-with-neo4j/#get-started-with-neo4j",target:"_blank",rel:"noopener noreferrer"},z={href:"https://neo4j.com/docs/getting-started/current/graphdb-concepts/#graphdb-concepts",target:"_blank",rel:"noopener noreferrer"},B={href:"https://neo4j.com/docs/getting-started/current/graphdb-concepts/#graphdb-concepts",target:"_blank",rel:"noopener noreferrer"},K={href:"https://neo4j.com/docs/getting-started/current/cypher-intro/#cypher-intro",target:"_blank",rel:"noopener noreferrer"},Z=e("p",null,[e("em",null,"\u8C01\u5E94\u8BE5\u8BFB\u8FD9\u4E2A\uFF1F")],-1),Q=e("p",null,"\u672C\u6307\u5357\u662F\u4E3A\u6B63\u5728\u63A2\u7D22 Neo4j \u548C Cypher \u7684\u4EFB\u4F55\u4EBA\u7F16\u5199\u7684\u3002",-1),Y=e("h2",{id:"\u5F00\u59CB\u4F7F\u7528-neo4j",tabindex:"-1"},[e("a",{class:"header-anchor",href:"#\u5F00\u59CB\u4F7F\u7528-neo4j","aria-hidden":"true"},"#"),n(" \u5F00\u59CB\u4F7F\u7528 Neo4j")],-1),X=e("p",null,"\u5173\u4E8E\u5982\u4F55\u5B89\u88C5 Neo4j \u4EE5\u53CA\u5982\u4F55\u5F00\u59CB\u8FD0\u884C Cypher \u67E5\u8BE2\uFF0C\u6709\u8BB8\u591A\u9009\u9879\u3002",-1),J=e("h3",{id:"_1-\u5B89\u88C5-neo4j",tabindex:"-1"},[e("a",{class:"header-anchor",href:"#_1-\u5B89\u88C5-neo4j","aria-hidden":"true"},"#"),n(" 1. \u5B89\u88C5 Neo4j")],-1),$={href:"https://neo4j.com/download/%E4%B8%8B%E8%BD%BD",target:"_blank",rel:"noopener noreferrer"},ee={href:"https://neo4j.com/try-neo4j/%E3%80%82",target:"_blank",rel:"noopener noreferrer"},ne=e("h3",{id:"_2-\u6587\u6863",tabindex:"-1"},[e("a",{class:"header-anchor",href:"#_2-\u6587\u6863","aria-hidden":"true"},"#"),n(" 2. \u6587\u6863")],-1),ie={href:"https://neo4j.com/docs/",target:"_blank",rel:"noopener noreferrer"},de=e("p",null,"\u5728\u8FD9\u91CC\u60A8\u53EF\u4EE5\u627E\u5230\u5B8C\u6574\u7684\u624B\u518C\uFF0C\u4F8B\u5982\uFF1A",-1),se={href:"https://neo4j.com/docs/cypher-manual/4.4/#cypher-manual",target:"_blank",rel:"noopener noreferrer"},re={href:"https://neo4j.com/docs/operations-manual/4.4/#operations-manual",target:"_blank",rel:"noopener noreferrer"},ae={href:"https://neo4j.com/docs/cypher-refcard/current",target:"_blank",rel:"noopener noreferrer"},oe=s('<p>\u6B64\u5916\uFF0C\u60A8\u53EF\u4EE5\u627E\u5230\u66F4\u4E13\u4E1A\u7684\u6587\u6863\u4EE5\u53CA API \u6587\u6863\u548C\u65E7 Neo4j \u7248\u672C\u7684\u6587\u6863\u3002</p><h2 id="\u56FE\u6570\u636E\u5E93\u6982\u5FF5" tabindex="-1"><a class="header-anchor" href="#\u56FE\u6570\u636E\u5E93\u6982\u5FF5" aria-hidden="true">#</a> \u56FE\u6570\u636E\u5E93\u6982\u5FF5</h2><p>Neo4j \u4F7F\u7528_\u5C5E\u6027\u56FE_\u6570\u636E\u5E93\u6A21\u578B\u3002</p><p>\u56FE\u6570\u636E\u7ED3\u6784\u7531\u53EF\u4EE5\u901A\u8FC7<strong>\u5173\u7CFB</strong>\u8FDE\u63A5\u7684<strong>\u8282\u70B9</strong>\uFF08\u79BB\u6563\u5BF9\u8C61\uFF09\u7EC4\u6210\u3002</p><p>\u793A\u4F8B 1. \u56FE\u7ED3\u6784\u7684\u6982\u5FF5\u3002</p><p>\u5177\u6709\u4E09\u4E2A\u8282\u70B9\uFF08\u5706\u5708\uFF09\u548C\u4E09\u4E2A\u5173\u7CFB\uFF08\u7BAD\u5934\uFF09\u7684\u56FE\u3002</p><p><img src="'+t+'" alt="\u56FE\u6982\u5FF5\u4E09\u8282\u70B9" loading="lazy"></p><p>Neo4j \u5C5E\u6027\u56FE\u6570\u636E\u5E93\u6A21\u578B\u5305\u62EC\uFF1A</p><ul><li><strong>\u8282\u70B9</strong>\u63CF\u8FF0\u57DF\u7684\u5B9E\u4F53\uFF08\u79BB\u6563\u5BF9\u8C61\uFF09\u3002</li><li><strong>\u8282\u70B9</strong>\u53EF\u4EE5\u6709\u96F6\u4E2A\u6216\u591A\u4E2A<strong>\u6807\u7B7E</strong>\u6765\u5B9A\u4E49\uFF08\u5206\u7C7B\uFF09\u5B83\u4EEC\u662F\u4EC0\u4E48\u7C7B\u578B\u7684\u8282\u70B9\u3002</li><li><strong>\u5173\u7CFB</strong>\u63CF\u8FF0\u4E86_\u6E90\u8282\u70B9_\u548C_\u76EE\u6807\u8282\u70B9_\u4E4B\u95F4\u7684\u8FDE\u63A5\u3002</li><li><strong>\u5173\u7CFB</strong>\u603B\u662F\u6709\u4E00\u4E2A\u65B9\u5411\uFF08\u4E00\u4E2A\u65B9\u5411\uFF09\u3002</li><li><strong>\u5173\u7CFB</strong>\u5FC5\u987B\u6709\u4E00\u4E2A<strong>\u7C7B\u578B</strong>\uFF08\u4E00\u79CD\u7C7B\u578B\uFF09\u6765\u5B9A\u4E49\uFF08\u5206\u7C7B\uFF09\u5B83\u4EEC\u662F\u4EC0\u4E48\u7C7B\u578B\u7684\u5173\u7CFB\u3002</li><li>\u8282\u70B9\u548C\u5173\u7CFB\u53EF\u4EE5\u5177\u6709\u8FDB\u4E00\u6B65\u63CF\u8FF0\u5B83\u4EEC\u7684<strong>\u5C5E\u6027</strong>\uFF08\u952E\u503C\u5BF9\uFF09\u3002</li></ul><p>\u5728\u6570\u5B66\u4E2D\uFF0C\u56FE\u8BBA\u662F\u5BF9\u56FE\u7684\u7814\u7A76\u3002\u5728\u56FE\u8BBA\u4E2D\uFF1A\u8282\u70B9\u4E5F\u79F0\u4E3A\u9876\u70B9\u6216\u70B9\u3002\u5173\u7CFB\u4E5F\u79F0\u4E3A\u8FB9\u3001\u94FE\u63A5\u6216\u7EBF\u3002</p><h3 id="_1-\u793A\u4F8B\u56FE" tabindex="-1"><a class="header-anchor" href="#_1-\u793A\u4F8B\u56FE" aria-hidden="true">#</a> 1. \u793A\u4F8B\u56FE</h3><p>\u4E0B\u9762\u7684\u793A\u4F8B\u56FE\uFF0C\u4ECB\u7ECD\u4E86\u5C5E\u6027\u56FE\u7684\u57FA\u672C\u6982\u5FF5\uFF1A</p><p>\u793A\u4F8B 2. \u793A\u4F8B\u56FE\u3002</p><p><img src="'+c+`" alt="\u56FE\u7B80\u5355" loading="lazy"></p><p>\u793A\u4F8B 3. \u5BC6\u7801\u3002</p><p>\u8981\u521B\u5EFA\u793A\u4F8B\u56FE\uFF0C\u8BF7\u4F7F\u7528 Cypher \u5B50\u53E5<code>CREATE</code>\u3002</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (:Person:Actor {name: &#39;Tom Hanks&#39;, born: 1956})-[:ACTED_IN {roles: [&#39;Forrest&#39;]}]-&gt;(:Movie {title: &#39;Forrest Gump&#39;})&lt;-[:DIRECTED]-(:Person {name: &#39;Robert Zemeckis&#39;, born: 1951})

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><h3 id="_2-\u8282\u70B9" tabindex="-1"><a class="header-anchor" href="#_2-\u8282\u70B9" aria-hidden="true">#</a> 2.\u8282\u70B9</h3><p>\u8282\u70B9\u7528\u4E8E\u8868\u793A\u57DF\u7684_\u5B9E\u4F53_\uFF08\u79BB\u6563\u5BF9\u8C61\uFF09\u3002</p><p>\u6700\u7B80\u5355\u7684\u56FE\u662F\u6CA1\u6709\u5173\u7CFB\u7684\u5355\u4E2A\u8282\u70B9\u3002\u8003\u8651\u4E0B\u56FE\uFF0C\u7531\u5355\u4E2A\u8282\u70B9\u7EC4\u6210\u3002</p><p>\u793A\u4F8B 4. \u8282\u70B9\u3002</p><p><img src="`+p+`" alt="\u56FE\u5355\u8282\u70B9" loading="lazy"></p><p>\u8282\u70B9\u6807\u7B7E\u662F\uFF1A</p><ul><li><code>Person</code></li><li><code>Actor</code></li></ul><p>\u5C5E\u6027\u662F\uFF1A</p><ul><li><code>name: Tom Hanks</code></li><li><code>born: 1956</code></li></ul><p>\u53EF\u4EE5\u4F7F\u7528 Cypher \u4F7F\u7528\u67E5\u8BE2\u521B\u5EFA\u8282\u70B9\uFF1A</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (:Person:Actor {name: &#39;Tom Hanks&#39;, born: 1956})

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><h3 id="_3-\u8282\u70B9\u6807\u7B7E" tabindex="-1"><a class="header-anchor" href="#_3-\u8282\u70B9\u6807\u7B7E" aria-hidden="true">#</a> 3. \u8282\u70B9\u6807\u7B7E</h3><p>\u6807\u7B7E\u901A\u8FC7\u5C06\u8282\u70B9\u5206\u7EC4\uFF08\u5206\u7C7B\uFF09\u5230\u96C6\u5408\u4E2D\u6765\u5851\u9020\u57DF\uFF0C\u5176\u4E2D\u5177\u6709\u7279\u5B9A\u6807\u7B7E\u7684\u6240\u6709\u8282\u70B9\u90FD\u5C5E\u4E8E\u540C\u4E00\u96C6\u5408\u3002</p><p>\u4F8B\u5982\uFF0C\u6240\u6709\u4EE3\u8868\u7528\u6237\u7684\u8282\u70B9\u90FD\u53EF\u4EE5\u7528\u6807\u7B7E\u6765\u6807\u8BB0<code>User</code>\u3002\u6709\u4E86\u5B83\uFF0C\u60A8\u5C31\u53EF\u4EE5\u8BA9 Neo4j \u4EC5\u5728\u60A8\u7684\u7528\u6237\u8282\u70B9\u4E0A\u6267\u884C\u64CD\u4F5C\uFF0C\u4F8B\u5982\u67E5\u627E\u5177\u6709\u7ED9\u5B9A\u540D\u79F0\u7684\u6240\u6709\u7528\u6237\u3002</p><p>\u7531\u4E8E\u53EF\u4EE5\u5728\u8FD0\u884C\u65F6\u6DFB\u52A0\u548C\u5220\u9664\u6807\u7B7E\uFF0C\u56E0\u6B64\u5B83\u4EEC\u8FD8\u53EF\u7528\u4E8E\u6807\u8BB0\u8282\u70B9\u7684\u4E34\u65F6\u72B6\u6001\u3002\u4E00\u4E2A<code>Suspended</code>\u6807\u7B7E\u53EF\u4EE5\u7528\u6765\u8868\u793A\u5DF2\u6682\u505C\u7684\u94F6\u884C\u8D26\u6237\uFF0C\u5E76\u4E14<code>Seasonal</code>\u6807\u7B7E\u53EF\u4EE5\u8868\u793A\u852C\u83DC\u76EE\u524D\u5728\u5B63\u8282\u3002</p><p>\u4E00\u4E2A\u8282\u70B9\u53EF\u4EE5\u6709\u96F6\u5230\u591A\u4E2A\u6807\u7B7E\u3002</p><p>\u5728\u8BE5\u793A\u4F8B\u56FE\u4E2D\uFF0C\u8282\u70B9\u7684\u6807\u7B7E\uFF0C<code>Person</code>\uFF0C<code>Actor</code>\uFF0C\u548C<code>Movie</code>\uFF0C\u7528\u4E8E\u63CF\u8FF0\uFF08\u5206\u7C7B\uFF09\u7684\u8282\u70B9\u3002\u53EF\u4EE5\u6DFB\u52A0\u66F4\u591A\u6807\u7B7E\u6765\u8868\u793A\u6570\u636E\u7684\u4E0D\u540C\u7EF4\u5EA6\u3002</p><p>\u4E0B\u56FE\u663E\u793A\u4E86\u591A\u4E2A\u6807\u7B7E\u7684\u4F7F\u7528\u3002</p><p>\u793A\u4F8B 5. \u591A\u4E2A\u6807\u7B7E\u3002</p><p><img src="`+v+'" alt="graphdb \u7B80\u5355\u6807\u7B7E\u591A" loading="lazy"></p><h3 id="_4-\u5173\u7CFB" tabindex="-1"><a class="header-anchor" href="#_4-\u5173\u7CFB" aria-hidden="true">#</a> 4. \u5173\u7CFB</h3><p>\u5173\u7CFB\u63CF\u8FF0\u4E86_\u6E90\u8282\u70B9_\u548C_\u76EE\u6807\u8282\u70B9_\u4E4B\u95F4\u7684\u8FDE\u63A5\u5982\u4F55\u76F8\u5173\u3002\u8282\u70B9\u53EF\u80FD\u4E0E\u81EA\u8EAB\u6709\u5173\u7CFB\u3002</p><p>\u5173\u7CFB\uFF1A</p><ul><li>\u8FDE\u63A5_\u6E90\u8282\u70B9_\u548C_\u76EE\u6807\u8282\u70B9_\u3002</li><li>\u6709\u4E00\u4E2A\u65B9\u5411\uFF08\u4E00\u4E2A\u65B9\u5411\uFF09\u3002</li><li>\u5FC5\u987B\u6709\u4E00\u4E2A<strong>\u7C7B\u578B</strong>\uFF08\u4E00\u79CD\u7C7B\u578B\uFF09\u6765\u5B9A\u4E49\uFF08\u5206\u7C7B\uFF09\u5B83\u662F\u4EC0\u4E48\u7C7B\u578B\u7684\u5173\u7CFB\u3002</li><li>\u53EF\u4EE5\u6709\u5C5E\u6027\uFF08\u952E\u503C\u5BF9\uFF09\uFF0C\u8FDB\u4E00\u6B65\u63CF\u8FF0\u5173\u7CFB\u3002</li></ul><p>\u5173\u7CFB\u5C06\u8282\u70B9\u7EC4\u7EC7\u6210\u7ED3\u6784\uFF0C\u5141\u8BB8\u56FE\u7C7B\u4F3C\u4E8E\u5217\u8868\u3001\u6811\u3001\u5730\u56FE\u6216\u590D\u5408\u5B9E\u4F53\u2014\u2014\u5176\u4E2D\u4EFB\u4F55\u4E00\u4E2A\u90FD\u53EF\u4EE5\u7EC4\u5408\u6210\u66F4\u590D\u6742\u3001\u76F8\u4E92\u5173\u8054\u4E30\u5BCC\u7684\u7ED3\u6784\u3002</p><p>\u793A\u4F8B 6. \u5173\u7CFB\u3002</p><p><img src="'+u+`" alt="\u56FE\u793A\u4F8B\u5173\u7CFB" loading="lazy"></p><p>\u8282\u70B9\u7C7B\u578B\uFF1A <code>ACTED_IN</code></p><p>\u5C5E\u6027\u662F\uFF1A</p><ul><li><code>roles: [&#39;Forrest&#39;]</code></li><li><code>performance: 5</code></li></ul><p>\u8BE5<code>roles</code>\u5C5E\u6027\u6709\u4E00\u4E2A\u6570\u7EC4\u503C\uFF0C\u5176\u4E2D\u5305\u542B\u5355\u4E2A\u9879\u76EE ( <code>&#39;Forrest&#39;</code>)\u3002</p><p>\u53EF\u4EE5\u4F7F\u7528 Cypher \u4F7F\u7528\u67E5\u8BE2\u521B\u5EFA\u5173\u7CFB\uFF1A</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE ()-[:ACTED_IN {roles: [&#39;Forrest&#39;], performance: 5}]-&gt;()

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p>\u60A8\u5FC5\u987B\u521B\u5EFA\u6216\u5F15\u7528_\u6E90\u8282\u70B9_\u548C_\u76EE\u6807\u8282\u70B9_\u624D\u80FD\u521B\u5EFA\u5173\u7CFB\u3002</p><p>\u5173\u7CFB\u603B\u662F\u6709\u65B9\u5411\u7684\u3002\u4F46\u662F\uFF0C\u5982\u679C\u65B9\u5411\u6CA1\u6709\u7528\u5904\uFF0C\u5219\u53EF\u4EE5\u5FFD\u7565\u8BE5\u65B9\u5411\u3002\u8FD9\u610F\u5473\u7740\u9664\u975E\u9700\u8981\u6B63\u786E\u63CF\u8FF0\u6570\u636E\u6A21\u578B\uFF0C\u5426\u5219\u65E0\u9700\u6DFB\u52A0\u76F8\u53CD\u65B9\u5411\u7684\u91CD\u590D\u5173\u7CFB\u3002</p><p>\u4E00\u4E2A\u8282\u70B9\u53EF\u4EE5\u4E0E\u5B83\u81EA\u5DF1\u6709\u5173\u7CFB\u3002\u8981\u8868\u8FBE<code>Tom Hanks</code> <code>KNOWS</code>\u4ED6\u81EA\u5DF1\u5C06\u88AB\u8868\u8FBE\u4E3A\uFF1A</p><p>\u793A\u4F8B 7. \u4E0E\u5355\u4E2A\u8282\u70B9\u7684\u5173\u7CFB\u3002</p><p><img src="`+m+'" alt="graphdb \u8282\u70B9\u548C rel self" loading="lazy"></p><h3 id="_5-\u5173\u7CFB\u7C7B\u578B" tabindex="-1"><a class="header-anchor" href="#_5-\u5173\u7CFB\u7C7B\u578B" aria-hidden="true">#</a> 5. \u5173\u7CFB\u7C7B\u578B</h3><p>\u4E00\u4E2A\u5173\u7CFB\u5FC5\u987B\u53EA\u6709\u4E00\u79CD\u5173\u7CFB\u7C7B\u578B\u3002</p><p>\u4E0B\u9762\u662F\u4E00\u4E2A<code>ACTED_IN</code>\u5173\u7CFB\uFF0C\u968F\u7740<code>Tom Hanks</code>\u8282\u70B9\u4F5C\u4E3A_\u6E90\u8282\u70B9_\u548C<code>Forrest Gump</code>\u4F5C\u4E3A_\u76EE\u6807\u8282\u70B9_\u3002</p><p>\u793A\u4F8B 8. \u5173\u7CFB\u7C7B\u578B\u3002</p><p><img src="'+h+`" alt="graphdb \u8282\u70B9\u548C rel" loading="lazy"></p><p>\u89C2\u5BDF<code>Tom Hanks</code>\u8282\u70B9\u6709_\u4F20\u51FA_\u5173\u7CFB\uFF0C\u800C<code>Forrest Gump</code>\u8282\u70B9\u6709_\u4F20\u5165_\u5173\u7CFB\u3002</p><h3 id="_6-\u5C5E\u6027" tabindex="-1"><a class="header-anchor" href="#_6-\u5C5E\u6027" aria-hidden="true">#</a> 6. \u5C5E\u6027</h3><p>\u5C5E\u6027\u662F\u7528\u4E8E\u5B58\u50A8\u8282\u70B9\u548C\u5173\u7CFB\u6570\u636E\u7684\u952E\u503C\u5BF9\u3002</p><p>\u5C5E\u6027\u7684\u503C\u90E8\u5206\uFF1A</p><ul><li>\u53EF\u4EE5\u5BB9\u7EB3\u4E0D\u540C\u7684\u6570\u636E\u7C7B\u578B\uFF0C\u4F8B\u5982<code>number</code>\uFF0C<code>string</code>\u6216<code>boolean</code>\u3002</li><li>\u53EF\u4EE5\u4FDD\u5B58\u5305\u542B\u4F8B\u5982\u5B57\u7B26\u4E32\u3001\u6570\u5B57\u6216\u5E03\u5C14\u503C\u7684\u540C\u7C7B\u5217\u8868\uFF08\u6570\u7EC4\uFF09\u3002</li></ul><p>\u793A\u4F8B 9. \u6570\u5B57</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (:Example {a: 1, b: 3.14})

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><ul><li>\u8BE5\u5C5E\u6027<code>a</code>\u5177\u6709<code>integer</code>\u503C\u4E3A\u7684\u7C7B\u578B<code>1</code>\u3002</li><li>\u8BE5\u5C5E\u6027<code>b</code>\u5177\u6709<code>float</code>\u503C\u4E3A\u7684\u7C7B\u578B<code>3.14</code>\u3002</li></ul><p>\u793A\u4F8B 10. \u5B57\u7B26\u4E32\u548C\u5E03\u5C14\u503C</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (:Example {c: &#39;This is an example string&#39;, d: true, e: false})

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><ul><li>\u8BE5\u5C5E\u6027<code>c</code>\u5177\u6709<code>string</code>\u503C\u4E3A\u7684\u7C7B\u578B<code>&#39;This is an example string&#39;</code>\u3002</li><li>\u8BE5\u5C5E\u6027<code>d</code>\u5177\u6709<code>boolean</code>\u503C\u4E3A\u7684\u7C7B\u578B<code>true</code>\u3002</li><li>\u8BE5\u5C5E\u6027<code>e</code>\u5177\u6709<code>boolean</code>\u503C\u4E3A\u7684\u7C7B\u578B<code>false</code>\u3002</li></ul><p>\u793A\u4F8B 11. \u5217\u8868</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (:Example {f: [1, 2, 3], g: [2.71, 3.14], h: [&#39;abc&#39;, &#39;example&#39;], i: [true, true, false]})

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><ul><li>\u8BE5\u5C5E\u6027<code>f</code>\u5305\u542B\u4E00\u4E2A\u503C\u4E3A \u7684\u6570\u7EC4<code>[1, 2, 3]</code>\u3002</li><li>\u8BE5\u5C5E\u6027<code>g</code>\u5305\u542B\u4E00\u4E2A\u503C\u4E3A \u7684\u6570\u7EC4<code>[2.71, 3.14]</code>\u3002</li><li>\u8BE5\u5C5E\u6027<code>h</code>\u5305\u542B\u4E00\u4E2A\u503C\u4E3A \u7684\u6570\u7EC4<code>[&#39;abc&#39;, &#39;example&#39;]</code>\u3002</li><li>\u8BE5\u5C5E\u6027<code>i</code>\u5305\u542B\u4E00\u4E2A\u503C\u4E3A \u7684\u6570\u7EC4<code>[true, true, false]</code>\u3002</li></ul>`,74),le={href:"https://neo4j.com/docs/cypher-manual/4.4/syntax/values/#cypher-values",target:"_blank",rel:"noopener noreferrer"},te=s('<h3 id="_7-\u904D\u5386\u548C\u8DEF\u5F84" tabindex="-1"><a class="header-anchor" href="#_7-\u904D\u5386\u548C\u8DEF\u5F84" aria-hidden="true">#</a> 7. \u904D\u5386\u548C\u8DEF\u5F84</h3><p>\u904D\u5386\u662F\u60A8\u67E5\u8BE2\u56FE\u5F62\u4EE5\u627E\u5230\u95EE\u9898\u7B54\u6848\u7684\u65B9\u5F0F\uFF0C\u4F8B\u5982\uFF1A\u201C\u6211\u7684\u670B\u53CB\u559C\u6B22\u54EA\u4E9B\u97F3\u4E50\u4F46\u6211\u5C1A\u672A\u62E5\u6709\uFF1F\u201D\u6216\u201C\u5982\u679C\u6B64\u7535\u6E90\u4E2D\u65AD\uFF0C\u54EA\u4E9B Web \u670D\u52A1\u4F1A\u53D7\u5230\u5F71\u54CD\uFF1F \u201D\u3002</p><p>\u904D\u5386\u56FE\u662F\u6307\u6309\u7167\u4E00\u5B9A\u7684\u89C4\u5219\u9075\u5FAA\u5173\u7CFB\u6765\u8BBF\u95EE\u8282\u70B9\u3002\u5728\u5927\u591A\u6570\u60C5\u51B5\u4E0B\uFF0C\u53EA\u4F1A\u8BBF\u95EE\u56FE\u7684\u4E00\u4E2A\u5B50\u96C6\u3002</p><p>\u793A\u4F8B 12. \u8DEF\u5F84\u5339\u914D\u3002</p><p>\u4E3A\u4E86\u6839\u636E\u5FAE\u578B\u793A\u4F8B\u6570\u636E\u5E93\u627E\u51FA\u6C64\u59C6\u6C49\u514B\u65AF\u51FA\u6F14\u7684\u7535\u5F71\uFF0C\u904D\u5386\u5C06\u4ECE<code>Tom Hanks</code>\u8282\u70B9\u5F00\u59CB\uFF0C\u9075\u5FAA<code>ACTED_IN</code>\u8FDE\u63A5\u5230\u8282\u70B9\u7684\u4EFB\u4F55\u5173\u7CFB\uFF0C\u6700\u540E<code>Forrest Gump</code>\u5F97\u5230\u7ED3\u679C\uFF08\u89C1\u865A\u7EBF\uFF09\uFF1A</p><p><img src="'+b+'" alt="graphdb\u904D\u5386" loading="lazy"></p><p>\u904D\u5386\u7ED3\u679C\u53EF\u4EE5\u4F5C\u4E3A\u957F\u5EA6\u4E3A \u7684\u8DEF\u5F84\u8FD4\u56DE<code>1</code>\uFF1A</p><p><img src="'+g+'" alt="\u56FE\u5F62\u6570\u636E\u5E93\u8DEF\u5F84" loading="lazy"></p><p>\u6700\u77ED\u8DEF\u5F84\u7684\u957F\u5EA6\u4E3A\u96F6\u3002\u5B83\u5305\u542B\u4E00\u4E2A\u8282\u70B9\uFF0C\u6CA1\u6709\u5173\u7CFB\u3002</p><p>\u793A\u4F8B 13. \u957F\u5EA6\u4E3A\u96F6\u7684\u8DEF\u5F84\u3002</p><p>\u4EC5\u5305\u542B\u5355\u4E2A\u8282\u70B9\u7684\u8DEF\u5F84\u7684\u957F\u5EA6\u4E3A<code>0</code>\u3002</p><p><img src="'+_+'" alt="graphdb \u8DEF\u5F84\u96F6" loading="lazy"></p><p>\u793A\u4F8B 14. \u957F\u5EA6\u4E3A 1 \u7684\u8DEF\u5F84\u3002</p><p>\u5305\u542B\u4E00\u4E2A\u5173\u7CFB\u7684\u8DEF\u5F84\u7684\u957F\u5EA6\u4E3A<code>1</code>\u3002</p><p><img src="'+x+'" alt="graphdb \u8DEF\u5F84\u793A\u4F8B\u5FAA\u73AF" loading="lazy"></p><h3 id="_8-\u67B6\u6784" tabindex="-1"><a class="header-anchor" href="#_8-\u67B6\u6784" aria-hidden="true">#</a> 8. \u67B6\u6784</h3><p>Neo4j \u4E2D\u7684_\u6A21\u5F0F_\u6307\u7684\u662F\u7D22\u5F15\u548C\u7EA6\u675F\u3002</p><p>Neo4j \u901A\u5E38\u88AB\u63CF\u8FF0\u4E3A_schema optional_\uFF0C\u8FD9\u610F\u5473\u7740\u6CA1\u6709\u5FC5\u8981\u521B\u5EFA\u7D22\u5F15\u548C\u7EA6\u675F\u3002\u60A8\u53EF\u4EE5\u521B\u5EFA\u6570\u636E\u2014\u2014\u8282\u70B9\u3001\u5173\u7CFB\u548C\u5C5E\u6027\u2014\u2014\u800C\u65E0\u9700\u9884\u5148\u5B9A\u4E49\u67B6\u6784\u3002\u53EF\u4EE5\u5728\u9700\u8981\u65F6\u5F15\u5165\u7D22\u5F15\u548C\u7EA6\u675F\uFF0C\u4EE5\u83B7\u5F97\u6027\u80FD\u6216\u5EFA\u6A21\u4F18\u52BF\u3002</p><h3 id="_9-\u7D22\u5F15" tabindex="-1"><a class="header-anchor" href="#_9-\u7D22\u5F15" aria-hidden="true">#</a> 9. \u7D22\u5F15</h3>',19),ce={href:"https://neo4j.com/docs/getting-started/current/cypher-intro/schema/#cypher-intro-indexes",target:"_blank",rel:"noopener noreferrer"},pe={href:"https://neo4j.com/docs/getting-started/current/cypher-intro/schema/#cypher-intro-indexes",target:"_blank",rel:"noopener noreferrer"},ve={href:"https://neo4j.com/docs/cypher-manual/4.4/indexes-for-full-text-search/#administration-indexes-fulltext-search",target:"_blank",rel:"noopener noreferrer"},ue=e("h3",{id:"_10-\u7EA6\u675F",tabindex:"-1"},[e("a",{class:"header-anchor",href:"#_10-\u7EA6\u675F","aria-hidden":"true"},"#"),n(" 10. \u7EA6\u675F")],-1),me={href:"https://neo4j.com/docs/getting-started/current/cypher-intro/schema/#cypher-intro-constraints",target:"_blank",rel:"noopener noreferrer"},he={href:"https://neo4j.com/docs/getting-started/current/cypher-intro/schema/#cypher-intro-constraints",target:"_blank",rel:"noopener noreferrer"},be={href:"https://neo4j.com/docs/cypher-manual/4.4/constraints/",target:"_blank",rel:"noopener noreferrer"},ge=s('<h3 id="_11-\u547D\u540D\u7EA6\u5B9A" tabindex="-1"><a class="header-anchor" href="#_11-\u547D\u540D\u7EA6\u5B9A" aria-hidden="true">#</a> 11.\u547D\u540D\u7EA6\u5B9A</h3><p>\u8282\u70B9\u6807\u7B7E\u3001\u5173\u7CFB\u7C7B\u578B\u548C\u5C5E\u6027\uFF08\u5173\u952E\u90E8\u5206\uFF09\u533A\u5206\u5927\u5C0F\u5199\uFF0C\u4F8B\u5982\uFF0C\u8FD9\u610F\u5473\u7740\u5C5E\u6027\u4E0E\u5C5E\u6027<code>name</code>\u4E0D\u540C<code>Name</code>\u3002</p><p>\u5EFA\u8BAE\u4F7F\u7528\u4EE5\u4E0B\u547D\u540D\u7EA6\u5B9A\uFF1A</p><table><thead><tr><th>\u56FE\u5B9E\u4F53</th><th>\u63A8\u8350\u6B3E\u5F0F</th><th>\u4F8B\u5B50</th></tr></thead><tbody><tr><td>\u8282\u70B9\u6807\u7B7E</td><td>\u9A7C\u5CF0\u5F0F\u5927\u5C0F\u5199\uFF0C\u4EE5\u5927\u5199\u5B57\u7B26\u5F00\u5934</td><td>:VehicleOwner<code>rather than</code>:vehice_owner</td></tr><tr><td>\u5173\u7CFB\u7C7B\u578B</td><td>\u5927\u5199\uFF0C\u4F7F\u7528\u4E0B\u5212\u7EBF\u5206\u9694\u5355\u8BCD</td><td>:OWNS_VEHICLE<code>rather than</code>:ownsVehicle</td></tr><tr><td>\u8D22\u4EA7</td><td>\u9A7C\u5CF0\u5C0F\u5199\uFF0C\u4EE5\u5C0F\u5199\u5B57\u7B26\u5F00\u5934</td><td>firstName<code>rather than</code>first_name</td></tr></tbody></table>',4),_e={href:"https://neo4j.com/docs/cypher-manual/4.4/syntax/naming/#cypher-naming",target:"_blank",rel:"noopener noreferrer"},xe=e("h2",{id:"cypher-\u7B80\u4ECB",tabindex:"-1"},[e("a",{class:"header-anchor",href:"#cypher-\u7B80\u4ECB","aria-hidden":"true"},"#"),n(" Cypher \u7B80\u4ECB")],-1),Ee=e("p",null,"\u672C\u8282\u5C06\u5411\u60A8\u4ECB\u7ECD\u56FE\u67E5\u8BE2\u8BED\u8A00 Cypher\u3002\u5B83\u5C06\u5E2E\u52A9\u60A8\u5F00\u59CB\u601D\u8003\u56FE\u5F62\u548C\u6A21\u5F0F\uFF0C\u5C06\u8FD9\u4E9B\u77E5\u8BC6\u5E94\u7528\u4E8E\u7B80\u5355\u7684\u95EE\u9898\uFF0C\u5E76\u5B66\u4E60\u5982\u4F55\u7F16\u5199 Cypher \u8BED\u53E5\u3002",-1),Ce={href:"https://neo4j.com/docs/cypher-manual/4.4/#cypher-manual",target:"_blank",rel:"noopener noreferrer"},Te=s(`<h3 id="\u4E00-\u3001\u56FE\u6848-patterns" tabindex="-1"><a class="header-anchor" href="#\u4E00-\u3001\u56FE\u6848-patterns" aria-hidden="true">#</a> \uFF08\u4E00\uFF09\u3001\u56FE\u6848\uFF08Patterns\uFF09</h3><p>Neo4j \u7684\u5C5E\u6027\u56FE\u7531\u8282\u70B9\u548C\u5173\u7CFB\u7EC4\u6210\uFF0C\u5176\u4E2D\u4EFB\u4F55\u4E00\u4E2A\u90FD\u53EF\u80FD\u5177\u6709\u5C5E\u6027\u3002\u8282\u70B9\u4EE3\u8868\u5B9E\u4F53\uFF0C\u4F8B\u5982\u6982\u5FF5\u3001\u4E8B\u4EF6\u3001\u5730\u70B9\u548C\u4E8B\u7269\u3002\u5173\u7CFB\u8FDE\u63A5\u6210\u5BF9\u7684\u8282\u70B9\u3002</p><p>\u4F46\u662F\uFF0C\u8282\u70B9\u548C\u5173\u7CFB\u53EF\u4EE5\u88AB\u89C6\u4E3A\u4F4E\u7EA7\u6784\u5EFA\u5757\u3002\u5C5E\u6027\u56FE\u7684\u771F\u6B63\u4F18\u52BF\u5728\u4E8E\u5B83\u80FD\u591F\u5BF9\u8FDE\u63A5\u8282\u70B9\u548C\u5173\u7CFB\u7684_\u6A21\u5F0F_\u8FDB\u884C\u7F16\u7801\u3002\u5355\u4E2A\u8282\u70B9\u6216\u5173\u7CFB\u901A\u5E38\u7F16\u7801\u7684\u4FE1\u606F\u5F88\u5C11\uFF0C\u4F46\u8282\u70B9\u548C\u5173\u7CFB\u7684\u6A21\u5F0F\u53EF\u4EE5\u7F16\u7801\u4EFB\u610F\u590D\u6742\u7684\u60F3\u6CD5\u3002</p><p>Neo4j \u7684\u67E5\u8BE2\u8BED\u8A00 Cypher \u5F3A\u70C8\u57FA\u4E8E\u6A21\u5F0F\u3002\u5177\u4F53\u6765\u8BF4\uFF0C\u6A21\u5F0F\u7528\u4E8E\u5339\u914D\u6240\u9700\u7684\u56FE\u5F62\u7ED3\u6784\u3002\u4E00\u65E6\u627E\u5230\u6216\u521B\u5EFA\u4E86\u5339\u914D\u7ED3\u6784\uFF0CNeo4j \u5C31\u53EF\u4EE5\u4F7F\u7528\u5B83\u8FDB\u884C\u8FDB\u4E00\u6B65\u5904\u7406\u3002</p><p>\u4E00\u4E2A\u7B80\u5355\u7684\u6A21\u5F0F\uFF0C\u53EA\u6709\u4E00\u4E2A\u5173\u7CFB\uFF0C\u8FDE\u63A5\u4E00\u5BF9\u8282\u70B9\uFF08\u6216\u8005\uFF0C\u5076\u5C14\uFF0C\u4E00\u4E2A\u8282\u70B9\u5230\u5B83\u81EA\u5DF1\uFF09\u3002\u4F8B\u5982\uFF0C<em>\u4E00\u4E2A\u4EBA</em> <code>LIVES_IN</code> <em>\u662F\u4E00\u4E2A\u57CE\u5E02_\u6216_\u4E00\u4E2A\u57CE\u5E02\u662F</em> <code>PART_OF</code> <em>\u4E00\u4E2A\u56FD\u5BB6</em>\u3002</p><p>\u590D\u6742\u6A21\u5F0F\uFF0C\u4F7F\u7528\u591A\u91CD\u5173\u7CFB\uFF0C\u53EF\u4EE5\u8868\u8FBE\u4EFB\u610F\u590D\u6742\u7684\u6982\u5FF5\u5E76\u652F\u6301\u5404\u79CD\u6709\u8DA3\u7684\u7528\u4F8B\u3002\u4F8B\u5982\uFF0C\u6211\u4EEC\u53EF\u80FD\u60F3\u8981\u5339\u914D_Person_ <code>LIVES_IN</code> _\u548C Country \u7684_\u5B9E\u4F8B\u3002\u4EE5\u4E0B Cypher \u4EE3\u7801\u5C06\u4E24\u4E2A\u7B80\u5355\u7684\u6A21\u5F0F\u7EC4\u5408\u6210\u4E00\u4E2A\u7A0D\u5FAE\u590D\u6742\u7684\u6A21\u5F0F\u6765\u6267\u884C\u6B64\u5339\u914D\uFF1A</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>(:Person) -[:LIVES_IN]-&gt; (:City) -[:PART_OF]-&gt; (:Country)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p>\u7531\u56FE\u6807\u548C\u7BAD\u5934\u7EC4\u6210\u7684\u56FE\u8868\u901A\u5E38\u7528\u4E8E\u53EF\u89C6\u5316\u56FE\u5F62\u3002\u6587\u672C\u6CE8\u91CA\u63D0\u4F9B\u6807\u7B7E\u3001\u5B9A\u4E49\u5C5E\u6027\u7B49\u3002</p><h4 id="_1\u3001\u8282\u70B9\u8BED\u6CD5" tabindex="-1"><a class="header-anchor" href="#_1\u3001\u8282\u70B9\u8BED\u6CD5" aria-hidden="true">#</a> 1\u3001\u8282\u70B9\u8BED\u6CD5</h4><p>Cypher \u4F7F\u7528\u4E00\u5BF9\u62EC\u53F7\u6765\u8868\u793A\u4E00\u4E2A\u8282\u70B9\uFF1A<code>()</code>. \u8FD9\u8BA9\u4EBA\u60F3\u8D77\u5E26\u6709\u5706\u5F62\u7AEF\u76D6\u7684\u5706\u5F62\u6216\u77E9\u5F62\u3002\u4E0B\u9762\u662F\u4E00\u4E9B\u8282\u70B9\u793A\u4F8B\uFF0C\u63D0\u4F9B\u4E86\u4E0D\u540C\u7C7B\u578B\u548C\u53D8\u91CF\u7684\u7EC6\u8282\uFF1A</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>()
(matrix)
(:Movie)
(matrix:Movie)
(matrix:Movie {title: &#39;The Matrix&#39;})
(matrix:Movie {title: &#39;The Matrix&#39;, released: 1997})

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u6700\u7B80\u5355\u7684\u5F62\u5F0F\uFF0C<code>()</code>\u4EE3\u8868\u4E00\u4E2A\u533F\u540D\u7684\u3001\u65E0\u7279\u5F81\u7684\u8282\u70B9\u3002\u5982\u679C\u6211\u4EEC\u60F3\u5728\u522B\u5904\u5F15\u7528\u8BE5\u8282\u70B9\uFF0C\u6211\u4EEC\u53EF\u4EE5\u6DFB\u52A0\u4E00\u4E2A\u53D8\u91CF\uFF0C\u4F8B\u5982\uFF1A<code>(matrix)</code>\u3002\u53D8\u91CF\u4EC5\u9650\u4E8E\u5355\u4E2A\u8BED\u53E5\u3002\u5B83\u5728\u53E6\u4E00\u4E2A\u9648\u8FF0\u4E2D\u53EF\u80FD\u5177\u6709\u4E0D\u540C\u7684\u542B\u4E49\u6216\u6CA1\u6709\u542B\u4E49\u3002</p><p>\u8BE5<code>:Movie</code>\u6A21\u5F0F\u58F0\u660E\u4E86\u8282\u70B9\u7684\u6807\u7B7E\u3002\u8FD9\u5141\u8BB8\u6211\u4EEC\u9650\u5236\u6A21\u5F0F\uFF0C\u4F7F\u5176\u4E0D\u5339\u914D\uFF08\u4F8B\u5982\uFF09\u5177\u6709<code>Actor</code>\u8BE5\u4F4D\u7F6E\u7684\u8282\u70B9\u7684\u7ED3\u6784\u3002</p><p>\u4F8B\u5982<code>title</code>\uFF0C\u8282\u70B9\u7684\u5C5E\u6027\u8868\u793A\u4E3A\u952E\u503C\u5BF9\u5217\u8868\uFF0C\u62EC\u5728\u4E00\u5BF9\u5927\u62EC\u53F7\u5185\uFF0C\u4F8B\u5982\uFF1A<code>{name: &#39;Keanu Reeves&#39;}</code>\u3002\u5C5E\u6027\u53EF\u7528\u4E8E\u5B58\u50A8\u4FE1\u606F\u548C/\u6216\u9650\u5236\u6A21\u5F0F\u3002</p><h4 id="_2-\u5173\u7CFB\u8BED\u6CD5" tabindex="-1"><a class="header-anchor" href="#_2-\u5173\u7CFB\u8BED\u6CD5" aria-hidden="true">#</a> 2. \u5173\u7CFB\u8BED\u6CD5</h4><p>Cypher \u4F7F\u7528\u4E00\u5BF9\u7834\u6298\u53F7 ( <code>--</code>) \u8868\u793A\u65E0\u5411\u5173\u7CFB\u3002\u5B9A\u5411\u5173\u7CFB\u7684\u4E00\u7AEF\u6709\u4E00\u4E2A\u7BAD\u5934 ( <code>&lt;--</code>, <code>--&gt;</code>)\u3002\u62EC\u53F7\u8868\u8FBE\u5F0F ( <code>[...]</code>) \u53EF\u7528\u4E8E\u6DFB\u52A0\u8BE6\u7EC6\u4FE1\u606F\u3002\u8FD9\u53EF\u80FD\u5305\u62EC\u53D8\u91CF\u3001\u5C5E\u6027\u548C\u7C7B\u578B\u4FE1\u606F\uFF1A</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>--&gt;
-[role]-&gt;
-[:ACTED_IN]-&gt;
-[role:ACTED_IN]-&gt;
-[role:ACTED_IN {roles: [&#39;Neo&#39;]}]-&gt;

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u5173\u7CFB\u7684\u62EC\u53F7\u5BF9\u4E2D\u7684\u8BED\u6CD5\u548C\u8BED\u4E49\u4E0E\u8282\u70B9\u62EC\u53F7\u4E4B\u95F4\u4F7F\u7528\u7684\u8BED\u6CD5\u548C\u8BED\u4E49\u975E\u5E38\u76F8\u4F3C\u3002<code>role</code>\u53EF\u4EE5\u5B9A\u4E49\u4E00\u4E2A\u53D8\u91CF\uFF08\u4F8B\u5982\uFF0Crole\uFF09\uFF0C\u4EE5\u4FBF\u5728\u8BED\u53E5\u7684\u5176\u4ED6\u5730\u65B9\u4F7F\u7528\u3002\u5173\u7CFB\u7684\u7C7B\u578B\uFF08\u4F8B\u5982\uFF0C<code>:ACTED_IN</code>\uFF09\u7C7B\u4F3C\u4E8E\u8282\u70B9\u7684\u6807\u7B7E\u3002\u5C5E\u6027\uFF08\u4F8B\u5982\uFF0C<code>roles</code>\uFF09\u5B8C\u5168\u7B49\u540C\u4E8E\u8282\u70B9\u5C5E\u6027\u3002</p><h4 id="_3-\u6A21\u5F0F\u8BED\u6CD5" tabindex="-1"><a class="header-anchor" href="#_3-\u6A21\u5F0F\u8BED\u6CD5" aria-hidden="true">#</a> 3. \u6A21\u5F0F\u8BED\u6CD5</h4><p>\u7ED3\u5408\u8282\u70B9\u548C\u5173\u7CFB\u7684\u8BED\u6CD5\uFF0C\u6211\u4EEC\u53EF\u4EE5\u8868\u8FBE\u6A21\u5F0F\u3002\u4EE5\u4E0B\u53EF\u80FD\u662F\u8BE5\u9886\u57DF\u4E2D\u7684\u4E00\u4E2A\u7B80\u5355\u6A21\u5F0F\uFF08\u6216\u4E8B\u5B9E\uFF09\uFF1A</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>(keanu:Person:Actor {name: &#39;Keanu Reeves&#39;})-[role:ACTED_IN {roles: [&#39;Neo&#39;]}]-&gt;(matrix:Movie {title: &#39;The Matrix&#39;})

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p>\u76F8\u5F53\u4E8E\u8282\u70B9\u6807\u7B7E\uFF0C<code>:ACTED_IN</code>\u6A21\u5F0F\u58F0\u660E\u4E86\u5173\u7CFB\u7684\u5173\u7CFB\u7C7B\u578B\u3002\u53D8\u91CF\uFF08\u4F8B\u5982\uFF0C<code>role</code>\uFF09\u53EF\u4EE5\u5728\u8BED\u53E5\u7684\u5176\u4ED6\u5730\u65B9\u4F7F\u7528\u6765\u6307\u4EE3\u5173\u7CFB\u3002</p><p>\u5982\u540C\u8282\u70B9\u5C5E\u6027\uFF0C\u5173\u7CFB\u5C5E\u6027\u88AB\u8868\u793A\u4E3A\u4E00\u5BF9\u5927\u62EC\u53F7\u62EC\u8D77\u6765\uFF0C\u4F8B\u5982\u952E/\u503C\u5BF9\u7684\u5217\u8868\uFF1A<code>{roles: [&#39;Neo&#39;]}</code>\u3002\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u6211\u4EEC\u4E3A \u4F7F\u7528\u4E86\u4E00\u4E2A\u6570\u7EC4\u5C5E\u6027<code>roles</code>\uFF0C\u5141\u8BB8\u6307\u5B9A\u591A\u4E2A\u89D2\u8272\u3002\u5C5E\u6027\u53EF\u7528\u4E8E\u5B58\u50A8\u4FE1\u606F\u548C/\u6216\u9650\u5236\u6A21\u5F0F\u3002</p><h4 id="_4-\u6A21\u5F0F\u53D8\u91CF" tabindex="-1"><a class="header-anchor" href="#_4-\u6A21\u5F0F\u53D8\u91CF" aria-hidden="true">#</a> 4. \u6A21\u5F0F\u53D8\u91CF</h4><p>\u4E3A\u4E86\u589E\u52A0\u6A21\u5757\u5316\u5E76\u51CF\u5C11\u91CD\u590D\uFF0CCypher \u5141\u8BB8\u5C06\u6A21\u5F0F\u5206\u914D\u7ED9\u53D8\u91CF\u3002\u8FD9\u5141\u8BB8\u68C0\u67E5\u5339\u914D\u8DEF\u5F84\uFF0C\u7528\u4E8E\u5176\u4ED6\u8868\u8FBE\u5F0F\u7B49\u3002</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>acted_in = (:Person)-[:ACTED_IN]-&gt;(:Movie)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8BE5<code>acted_in</code>\u53D8\u91CF\u5C06\u5305\u542B\u4E24\u4E2A\u8282\u70B9\u4EE5\u53CA\u627E\u5230\u6216\u521B\u5EFA\u7684\u6BCF\u6761\u8DEF\u5F84\u7684\u8FDE\u63A5\u5173\u7CFB\u3002\u6709\u591A\u9879\u529F\u80FD\u7684\u8DEF\u5F84\uFF0C\u4F8B\u5982\u8BBF\u95EE\u7EC6\u8282\uFF1A<code>nodes(path)</code>\uFF0C<code>relationships(path)</code>\uFF0C\u548C<code>length(path)</code>\u3002</p><h4 id="_5-\u89C4\u5219" tabindex="-1"><a class="header-anchor" href="#_5-\u89C4\u5219" aria-hidden="true">#</a> 5. \u89C4\u5219</h4><p>Cypher \u8BED\u53E5\u901A\u5E38\u6709\u591A\u4E2A_\u5B50\u53E5_\uFF0C\u6BCF\u4E2A_\u5B50\u53E5_\u6267\u884C\u4E00\u4E2A\u7279\u5B9A\u7684\u4EFB\u52A1\uFF0C\u4F8B\u5982\uFF1A</p><ul><li>\u5728\u56FE\u4E2D\u521B\u5EFA\u548C\u5339\u914D\u6A21\u5F0F</li><li>\u8FC7\u6EE4\u3001\u6295\u5F71\u3001\u6392\u5E8F\u6216\u5206\u9875\u7ED3\u679C</li><li>\u64B0\u5199\u90E8\u5206\u9648\u8FF0</li></ul><p>\u901A\u8FC7\u7EC4\u5408 Cypher \u5B50\u53E5\uFF0C\u6211\u4EEC\u53EF\u4EE5\u7EC4\u5408\u66F4\u590D\u6742\u7684\u8BED\u53E5\u6765\u8868\u8FBE\u6211\u4EEC\u60F3\u8981\u77E5\u9053\u6216\u521B\u5EFA\u7684\u5185\u5BB9\u3002</p><h3 id="\u6A21\u5F0F\u5B9E\u8DF5" tabindex="-1"><a class="header-anchor" href="#\u6A21\u5F0F\u5B9E\u8DF5" aria-hidden="true">#</a> \u6A21\u5F0F\u5B9E\u8DF5</h3><h4 id="_1-\u521B\u5EFA\u6570\u636E" tabindex="-1"><a class="header-anchor" href="#_1-\u521B\u5EFA\u6570\u636E" aria-hidden="true">#</a> 1. \u521B\u5EFA\u6570\u636E</h4><p>\u6211\u4EEC\u5C06\u9996\u5148\u7814\u7A76\u5141\u8BB8\u6211\u4EEC\u521B\u5EFA\u6570\u636E\u7684\u5B50\u53E5\u3002</p><p>\u8981\u6DFB\u52A0\u6570\u636E\uFF0C\u6211\u4EEC\u53EA\u4F7F\u7528\u6211\u4EEC\u5DF2\u7ECF\u77E5\u9053\u7684\u6A21\u5F0F\u3002\u901A\u8FC7\u63D0\u4F9B\u6A21\u5F0F\uFF0C\u6211\u4EEC\u53EF\u4EE5\u6307\u5B9A\u6211\u4EEC\u5E0C\u671B\u5C06\u54EA\u4E9B\u56FE\u5F62\u7ED3\u6784\u3001\u6807\u7B7E\u548C\u5C5E\u6027\u4F5C\u4E3A\u56FE\u5F62\u7684\u4E00\u90E8\u5206\u3002</p><p>\u663E\u7136\uFF0C\u6700\u7B80\u5355\u7684\u5B50\u53E5\u79F0\u4E3A<code>CREATE</code>\u3002\u5B83\u4F1A\u7EE7\u7EED\u76F4\u63A5\u521B\u5EFA\u60A8\u6307\u5B9A\u7684\u6A21\u5F0F\u3002</p><p>\u5BF9\u4E8E\u6211\u4EEC\u76EE\u524D\u770B\u5230\u7684\u6A21\u5F0F\uFF0C\u5B83\u53EF\u80FD\u5982\u4E0B\u6240\u793A\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (:Movie {title: &#39;The Matrix&#39;, released: 1997})

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p>\u5982\u679C\u6211\u4EEC\u6267\u884C\u6B64\u8BED\u53E5\uFF0CCypher \u4F1A\u8FD4\u56DE\u66F4\u6539\u7684\u6570\u91CF\uFF0C\u5728\u672C\u4F8B\u4E2D\u6DFB\u52A0 1 \u4E2A\u8282\u70B9\u30011 \u4E2A\u6807\u7B7E\u548C 2 \u4E2A\u5C5E\u6027\u3002</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Created Nodes: 1
Added Labels: 1
Set Properties: 2
Rows: 0

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u5F53\u6211\u4EEC\u4ECE\u4E00\u4E2A\u7A7A\u6570\u636E\u5E93\u5F00\u59CB\u65F6\uFF0C\u6211\u4EEC\u73B0\u5728\u6709\u4E00\u4E2A\u5305\u542B\u5355\u4E2A\u8282\u70B9\u7684\u6570\u636E\u5E93\uFF1A</p><p><img src="`+E+`" alt="\u5B9E\u8DF5\u4E2D\u7684\u5BC6\u7801\u4ECB\u7ECD\u6A21\u5F0F01" loading="lazy"></p><p>\u5982\u679C\u6211\u4EEC\u8FD8\u60F3\u8FD4\u56DE\u521B\u5EFA\u7684\u6570\u636E\uFF0C\u6211\u4EEC\u53EF\u4EE5\u6DFB\u52A0\u4E00\u4E2A<code>RETURN</code>\u5B50\u53E5\uFF0C\u5B83\u5F15\u7528\u6211\u4EEC\u5206\u914D\u7ED9\u6A21\u5F0F\u5143\u7D20\u7684\u53D8\u91CF\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (p:Person {name: &#39;Keanu Reeves&#39;, born: 1964})
RETURN p

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8FD9\u662F\u8FD4\u56DE\u7684\u5185\u5BB9\uFF1A</p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Created Nodes: 1
Added Labels: 1
Set Properties: 2
Rows: 1

+----------------------------------------------+
| p                                            |
+----------------------------------------------+
| (:Person {name: &#39;Keanu Reeves&#39;, born: 1964}) |
+----------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u5982\u679C\u6211\u4EEC\u60F3\u521B\u5EFA\u591A\u4E2A\u5143\u7D20\uFF0C\u6211\u4EEC\u53EF\u4EE5\u7528\u9017\u53F7\uFF08 , \uFF09\u5206\u9694\u5143\u7D20\u6216\u4F7F\u7528\u591A\u4E2A<code>CREATE</code>\u8BED\u53E5\u3002</p><p>\u6211\u4EEC\u5F53\u7136\u4E5F\u53EF\u4EE5\u521B\u5EFA\u66F4\u590D\u6742\u7684\u7ED3\u6784\uFF0C\u4F8B\u5982<code>ACTED_IN</code>\u4E0E\u89D2\u8272\u4FE1\u606F\u6216<code>DIRECTED</code>\u5BFC\u6F14\u4FE1\u606F\u7684\u5173\u7CFB\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (a:Person {name: &#39;Tom Hanks&#39;, born: 1956})-[r:ACTED_IN {roles: [&#39;Forrest&#39;]}]-&gt;(m:Movie {title: &#39;Forrest Gump&#39;, released: 1994})
CREATE (d:Person {name: &#39;Robert Zemeckis&#39;, born: 1951})-[:DIRECTED]-&gt;(m)
RETURN a, d, r, m

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8FD9\u662F\u6211\u4EEC\u521A\u521A\u66F4\u65B0\u7684\u56FE\u8868\u90E8\u5206\uFF1A</p><p><img src="`+C+`" alt="\u5B9E\u8DF5\u4E2D\u7684\u5BC6\u7801\u4ECB\u7ECD\u6A21\u5F0F02" loading="lazy"></p><p>\u5728\u5927\u591A\u6570\u60C5\u51B5\u4E0B\uFF0C\u6211\u4EEC\u5E0C\u671B\u5C06\u65B0\u6570\u636E\u8FDE\u63A5\u5230\u73B0\u6709\u7ED3\u6784\u3002\u8FD9\u8981\u6C42\u6211\u4EEC\u77E5\u9053\u5982\u4F55\u5728\u6211\u4EEC\u7684\u56FE\u5F62\u6570\u636E\u4E2D\u627E\u5230\u73B0\u6709\u7684\u6A21\u5F0F\uFF0C\u6211\u4EEC\u5C06\u5728\u63A5\u4E0B\u6765\u8FDB\u884C\u7814\u7A76\u3002</p><h4 id="_2-\u5339\u914D\u6A21\u5F0F" tabindex="-1"><a class="header-anchor" href="#_2-\u5339\u914D\u6A21\u5F0F" aria-hidden="true">#</a> 2. \u5339\u914D\u6A21\u5F0F</h4><p>\u5339\u914D\u6A21\u5F0F\u662F<code>MATCH</code>\u8BED\u53E5\u7684\u4EFB\u52A1\u3002\u6211\u4EEC\u4F20\u9012\u5230\u76EE\u524D\u4E3A\u6B62\u4F7F\u7528\u7684\u76F8\u540C\u7C7B\u578B\u7684\u6A21\u5F0F<code>MATCH</code>\u6765\u63CF\u8FF0\u6211\u4EEC\u6B63\u5728\u5BFB\u627E\u7684\u5185\u5BB9\u3002\u5B83\u7C7B\u4F3C\u4E8E_query by example_\uFF0C\u53EA\u662F\u6211\u4EEC\u7684\u4F8B\u5B50\u4E5F\u5305\u62EC\u7ED3\u6784\u3002</p><p>\u4E00\u6761<code>MATCH</code>\u8BED\u53E5\u5C06\u641C\u7D22\u6211\u4EEC\u6307\u5B9A\u7684\u6A21\u5F0F\uFF0C\u5E76_\u4E3A\u6BCF\u4E2A\u6210\u529F\u7684\u6A21\u5F0F\u5339\u914D_\u8FD4\u56DE_\u4E00\u884C_\u3002</p><p>\u4E3A\u4E86\u627E\u5230\u5230\u76EE\u524D\u4E3A\u6B62\u6211\u4EEC\u521B\u5EFA\u7684\u6570\u636E\uFF0C\u6211\u4EEC\u53EF\u4EE5\u5F00\u59CB\u5BFB\u627E\u6240\u6709\u6807\u6709<code>Movie</code>\u6807\u7B7E\u7684\u8282\u70B9\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (m:Movie)
RETURN m

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u7ED3\u679C\u5982\u4E0B\uFF1A</p><p><img src="`+T+`" alt="\u5B9E\u8DF5\u4E2D\u7684\u5BC6\u7801\u4ECB\u7ECD\u6A21\u5F0F03" loading="lazy"></p><p>\u8FD9\u5E94\u8BE5\u540C\u65F6\u663E\u793A_The Matrix_\u548C_Forrest Gump_\u3002</p><p>\u6211\u4EEC\u4E5F\u53EF\u4EE5\u627E\u4E00\u4E2A\u7279\u5B9A\u7684\u4EBA\uFF0C\u6BD4\u5982_\u57FA\u52AA\u91CC\u7EF4\u65AF_\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (p:Person {name: &#39;Keanu Reeves&#39;})
RETURN p

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u6B64\u67E5\u8BE2\u8FD4\u56DE\u5339\u914D\u7684\u8282\u70B9\uFF1A</p><p><img src="`+R+`" alt="\u5B9E\u8DF5\u4E2D\u7684\u5BC6\u7801\u4ECB\u7ECD\u6A21\u5F0F04" loading="lazy"></p><p>\u5728\u8FD9\u91CC\u9700\u8981\u6CE8\u610F\u7684\u662F\uFF0C\u6211\u4EEC\u4EC5\u63D0\u4F9B\u8DB3\u591F\u7684\u4FE1\u606F\u6765\u67E5\u627E\u8282\u70B9\uFF0C\u5E76\u975E\u6240\u6709\u5C5E\u6027\u90FD\u662F\u5FC5\u9700\u7684\u3002\u5728\u5927\u591A\u6570\u60C5\u51B5\u4E0B\uFF0C\u60A8\u9700\u8981\u67E5\u627E\u5173\u952E\u5C5E\u6027\uFF0C\u4F8B\u5982 SSN\u3001ISBN\u3001\u7535\u5B50\u90AE\u4EF6\u3001\u767B\u5F55\u540D\u3001\u5730\u7406\u4F4D\u7F6E\u6216\u4EA7\u54C1\u4EE3\u7801\u3002</p><p>\u6211\u4EEC\u8FD8\u53EF\u4EE5\u627E\u5230\u66F4\u591A\u6709\u8DA3\u7684\u8054\u7CFB\uFF0C\u4F8B\u5982_\u6C64\u59C6\u6C49\u514B\u65AF_\u626E\u6F14\u7684\u7535\u5F71\u540D\u79F0\u548C\u4ED6\u626E\u6F14\u7684\u89D2\u8272\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (p:Person {name: &#39;Tom Hanks&#39;})-[r:ACTED_IN]-&gt;(m:Movie)
RETURN m.title, r.roles


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 1

+------------------------------+
| m.title        | r.roles     |
+------------------------------+
| &#39;Forrest Gump&#39; | [&#39;Forrest&#39;] |
+------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u6211\u4EEC\u53EA\u8FD4\u56DE\u6211\u4EEC\u611F\u5174\u8DA3\u7684\u8282\u70B9\u548C\u5173\u7CFB\u7684\u5C5E\u6027\u3002\u60A8\u53EF\u4EE5\u901A\u8FC7\u70B9\u7B26\u53F7\u5728\u4EFB\u4F55\u5730\u65B9\u8BBF\u95EE\u5B83\u4EEC<code>identifer.property</code>\u3002</p><p>\u5F53\u7136\uFF0C\u8FD9\u53EA\u662F\u5217\u51FA\u4E86\u4ED6\u5728\u300A_\u963F\u7518\u6B63\u4F20\u300B\u4E2D_\u4F5C\u4E3A_Forrest \u7684_\u89D2\u8272\uFF0C\u56E0\u4E3A\u8FD9\u662F\u6211\u4EEC\u6DFB\u52A0\u7684\u6240\u6709\u6570\u636E\u3002</p><p>\u73B0\u5728\u6211\u4EEC\u77E5\u9053\u8DB3\u4EE5\u5C06\u65B0\u8282\u70B9\u8FDE\u63A5\u5230\u73B0\u6709\u8282\u70B9\uFF0C\u5E76\u4E14\u53EF\u4EE5\u7EC4\u5408<code>MATCH</code>\u5E76<code>CREATE</code>\u9644\u52A0\u7ED3\u6784\u5230\u56FE\u4E2D\u3002</p><h4 id="_3-\u9644\u7740\u7ED3\u6784" tabindex="-1"><a class="header-anchor" href="#_3-\u9644\u7740\u7ED3\u6784" aria-hidden="true">#</a> 3. \u9644\u7740\u7ED3\u6784</h4><p>\u4E3A\u4E86\u7528\u65B0\u4FE1\u606F\u6269\u5C55\u56FE\uFF0C\u6211\u4EEC\u9996\u5148\u5339\u914D\u73B0\u6709\u7684\u8FDE\u63A5\u70B9\uFF0C\u7136\u540E\u901A\u8FC7\u5173\u7CFB\u5C06\u65B0\u521B\u5EFA\u7684\u8282\u70B9\u9644\u52A0\u5230\u5B83\u4EEC\u3002\u5C06_Cloud Atlas_\u6DFB\u52A0\u4E3A_Tom Hanks_\u7684\u65B0\u7535\u5F71\u53EF\u4EE5\u8FD9\u6837\u5B9E\u73B0\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (p:Person {name: &#39;Tom Hanks&#39;})
CREATE (m:Movie {title: &#39;Cloud Atlas&#39;, released: 2012})
CREATE (p)-[r:ACTED_IN {roles: [&#39;Zachry&#39;]}]-&gt;(m)
RETURN p, r, m

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u4EE5\u4E0B\u662F\u6570\u636E\u5E93\u4E2D\u7684\u7ED3\u6784\uFF1A</p><p><img src="`+y+`" alt="\u5B9E\u8DF5\u4E2D\u7684\u5BC6\u7801\u4ECB\u7ECD\u6A21\u5F0F05" loading="lazy"></p><p>\u91CD\u8981\u7684\u662F\u8981\u8BB0\u4F4F\uFF0C\u6211\u4EEC\u53EF\u4EE5\u4E3A\u8282\u70B9\u548C\u5173\u7CFB\u5206\u914D\u53D8\u91CF\u5E76\u5728\u4EE5\u540E\u4F7F\u7528\u5B83\u4EEC\uFF0C\u65E0\u8BBA\u5B83\u4EEC\u662F\u521B\u5EFA\u7684\u8FD8\u662F\u5339\u914D\u7684\u3002</p><p>\u53EF\u4EE5\u5728\u5355\u4E2A<code>CREATE</code>\u5B50\u53E5\u4E2D\u9644\u52A0\u8282\u70B9\u548C\u5173\u7CFB\u3002\u4E3A\u4E86\u53EF\u8BFB\u6027\uFF0C\u5C06\u5B83\u4EEC\u5206\u5F00\u662F\u6709\u5E2E\u52A9\u7684\u3002</p><p><code>MATCH</code>\u548C\u7EC4\u5408\u7684\u4E00\u4E2A\u68D8\u624B\u65B9\u9762<code>CREATE</code>\u662F\u6211\u4EEC_\u6BCF\u4E2A\u5339\u914D\u7684\u6A21\u5F0F_\u90FD\u5F97\u5230_\u4E00\u884C_\u3002\u8FD9\u4F1A\u5BFC\u81F4<code>CREATE</code>\u5BF9\u6BCF\u4E00\u884C\u6267\u884C\u4E00\u6B21\u540E\u7EED\u8BED\u53E5\u3002\u5728\u8BB8\u591A\u60C5\u51B5\u4E0B\uFF0C\u8FD9\u6B63\u662F\u60A8\u60F3\u8981\u7684\u3002\u5982\u679C\u8FD9\u4E0D\u662F\u6545\u610F\u7684\uFF0C\u8BF7\u5C06<code>CREATE</code>\u8BED\u53E5\u79FB\u5230\u4E4B\u524D<code>MATCH</code>\uFF0C\u6216\u8005\u4F7F\u7528\u7A0D\u540E\u8BA8\u8BBA\u7684\u65B9\u6CD5\u66F4\u6539\u67E5\u8BE2\u7684\u57FA\u6570\uFF0C\u6216\u8005\u4F7F\u7528\u4E0B\u4E00\u4E2A\u5B50\u53E5\u7684_get \u6216 create_\u8BED\u4E49\uFF1A<code>MERGE</code>\u3002</p><h4 id="_4-\u5B8C\u6210\u6A21\u5F0F" tabindex="-1"><a class="header-anchor" href="#_4-\u5B8C\u6210\u6A21\u5F0F" aria-hidden="true">#</a> 4. \u5B8C\u6210\u6A21\u5F0F</h4><p>\u6BCF\u5F53\u6211\u4EEC\u4ECE\u5916\u90E8\u7CFB\u7EDF\u83B7\u53D6\u6570\u636E\u6216\u4E0D\u786E\u5B9A\u56FE\u4E2D\u662F\u5426\u5DF2\u7ECF\u5B58\u5728\u67D0\u4E9B\u4FE1\u606F\u65F6\uFF0C\u6211\u4EEC\u90FD\u5E0C\u671B\u80FD\u591F\u8868\u8FBE\u53EF\u91CD\u590D\uFF08\u5E42\u7B49\uFF09\u7684\u66F4\u65B0\u64CD\u4F5C\u3002\u5728 Cypher \u4E2D<code>MERGE</code>\u6709\u8FD9\u4E2A\u529F\u80FD\u3002\u5B83\u7684\u4F5C\u7528\u7C7B\u4F3C\u4E8E<code>MATCH</code> <em>or</em> \u7684\u7EC4\u5408<code>CREATE</code>\uFF0C\u5B83\u5728\u521B\u5EFA\u6570\u636E\u4E4B\u524D\u9996\u5148\u68C0\u67E5\u6570\u636E\u662F\u5426\u5B58\u5728\u3002\u4E0E<code>MERGE</code>\u60A8\u4E00\u8D77\u5B9A\u4E49\u8981\u67E5\u627E\u6216\u521B\u5EFA\u7684\u6A21\u5F0F\u3002\u901A\u5E38\uFF0C\u4E0E<code>MATCH</code>\u60A8\u4E00\u6837\uFF0C\u60A8\u53EA\u60F3\u5305\u542B\u8981\u5728\u6838\u5FC3\u6A21\u5F0F\u4E2D\u67E5\u627E\u7684\u5173\u952E\u5C5E\u6027\u3002 <code>MERGE</code>\u5141\u8BB8\u60A8\u63D0\u4F9B\u8981\u8BBE\u7F6E\u7684\u5176\u4ED6\u5C5E\u6027<code>ON CREATE</code>\u3002</p><p>\u5982\u679C\u6211\u4EEC\u4E0D\u77E5\u9053\u6211\u4EEC\u7684\u56FE\u5F62\u662F\u5426\u5DF2\u7ECF\u5305\u542B_Cloud Atlas\uFF0C_\u6211\u4EEC\u53EF\u4EE5\u518D\u6B21\u5C06\u5176\u5408\u5E76\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MERGE (m:Movie {title: &#39;Cloud Atlas&#39;})
ON CREATE SET m.released = 2012
RETURN m


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Created Nodes: 1
Added Labels: 1
Set Properties: 2
Rows: 1

+-------------------------------------------------+
| m                                               |
+-------------------------------------------------+
| (:Movie {title: &#39;Cloud Atlas&#39;, released: 2012}) |
+-------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u6211\u4EEC\u5728\u4EFB\u4F55\u4E24\u79CD\u60C5\u51B5\u4E0B\u90FD\u4F1A\u5F97\u5230\u7ED3\u679C\uFF1A\u8981\u4E48\u662F\u56FE\u4E2D\u5DF2\u7ECF\u5B58\u5728\u7684\u6570\u636E\uFF08\u53EF\u80FD\u4E0D\u6B62\u4E00\u884C\uFF09\uFF0C\u8981\u4E48\u662F\u4E00\u4E2A\u65B0\u521B\u5EFA\u7684<code>Movie</code>\u8282\u70B9\u3002</p><p>\u5176\u4E2D<code>MERGE</code>\u6CA1\u6709\u4EFB\u4F55\u5148\u524D\u5206\u914D\u7684\u53D8\u91CF\u7684\u5B50\u53E5\u5339\u914D\u5B8C\u6574\u6A21\u5F0F\u6216\u521B\u5EFA\u5B8C\u6574\u6A21\u5F0F\u3002\u5B83\u6C38\u8FDC\u4E0D\u4F1A\u5728\u6A21\u5F0F\u4E2D\u4EA7\u751F\u5339\u914D\u548C\u521B\u5EFA\u7684\u90E8\u5206\u6DF7\u5408\u3002\u8981\u5B9E\u73B0\u90E8\u5206\u5339\u914D/\u521B\u5EFA\uFF0C\u8BF7\u786E\u4FDD\u5BF9\u4E0D\u5E94\u53D7\u5230\u5F71\u54CD\u7684\u90E8\u5206\u4F7F\u7528\u5DF2\u5B9A\u4E49\u7684\u53D8\u91CF\u3002</p><p>\u56E0\u6B64\uFF0C\u6700\u91CD\u8981\u7684<code>MERGE</code>\u662F\u786E\u4FDD\u60A8\u4E0D\u80FD\u521B\u5EFA\u91CD\u590D\u7684\u4FE1\u606F\u6216\u7ED3\u6784\uFF0C\u4F46\u8FD9\u9700\u8981\u9996\u5148\u68C0\u67E5\u73B0\u6709\u5339\u914D\u9879\u7684\u6210\u672C\u3002\u7279\u522B\u662F\u5728\u5927\u578B\u56FE\u4E0A\uFF0C\u626B\u63CF\u5927\u91CF\u6807\u8BB0\u8282\u70B9\u4EE5\u83B7\u5F97\u7279\u5B9A\u5C5E\u6027\u7684\u6210\u672C\u53EF\u80FD\u5F88\u9AD8\u3002\u60A8\u53EF\u4EE5\u901A\u8FC7\u521B\u5EFA\u652F\u6301\u7D22\u5F15\u6216\u7EA6\u675F\u6765\u7F13\u89E3\u5176\u4E2D\u7684\u4E00\u4E9B\u95EE\u9898\uFF0C\u6211\u4EEC\u5C06\u5728\u7A0D\u540E\u8BA8\u8BBA\u3002\u4F46\u5B83\u4ECD\u7136\u4E0D\u662F\u514D\u8D39\u7684\uFF0C\u6240\u4EE5\u6BCF\u5F53\u4F60\u4E00\u5B9A\u4E0D\u4F1A\u521B\u5EFA\u91CD\u590D\u6570\u636E\u4F7F\u7528<code>CREATE</code>\u4E86<code>MERGE</code>\u3002</p><p><code>MERGE</code>\u4E5F\u53EF\u4EE5\u65AD\u8A00\u5173\u7CFB\u53EA\u521B\u5EFA\u4E00\u6B21\u3002\u4E3A\u6B64\uFF0C\u60A8_\u5FC5\u987B_\u4ECE\u5148\u524D\u7684\u6A21\u5F0F\u5339\u914D\u4E2D_\u4F20\u5165_\u4E24\u4E2A\u8282\u70B9\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (m:Movie {title: &#39;Cloud Atlas&#39;})
MATCH (p:Person {name: &#39;Tom Hanks&#39;})
MERGE (p)-[r:ACTED_IN]-&gt;(m)
ON CREATE SET r.roles =[&#39;Zachry&#39;]
RETURN p, r, m

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p><img src="`+A+`" alt="\u5B9E\u8DF5\u4E2D\u7684\u5BC6\u7801\u4ECB\u7ECD\u6A21\u5F0F06" loading="lazy"></p><p>\u5982\u679C\u5173\u7CFB\u7684\u65B9\u5411\u662F\u4EFB\u610F\u7684\uFF0C\u60A8\u53EF\u4EE5\u4E0D\u4F7F\u7528\u7BAD\u5934\u3002 <code>MERGE</code>\u7136\u540E\u5C06\u68C0\u67E5\u4EFB\u4E00\u65B9\u5411\u7684\u5173\u7CFB\uFF0C\u5982\u679C\u672A\u627E\u5230\u5339\u914D\u5173\u7CFB\uFF0C\u5219\u521B\u5EFA\u65B0\u7684\u5B9A\u5411\u5173\u7CFB\u3002</p><p>\u5982\u679C\u60A8\u9009\u62E9\u53EA\u4F20\u5165\u524D\u4E00\u4E2A\u5B50\u53E5\u4E2D\u7684\u4E00\u4E2A\u8282\u70B9\uFF0C<code>MERGE</code>\u5219\u4F1A\u63D0\u4F9B\u4E00\u4E2A\u6709\u8DA3\u7684\u529F\u80FD\u3002\u7136\u540E\u5B83\u53EA\u4F1A\u5728\u7ED9\u5B9A\u6A21\u5F0F\u7684\u63D0\u4F9B\u8282\u70B9\u7684\u76F4\u63A5\u90BB\u57DF\u5185\u5339\u914D\uFF0C\u5982\u679C\u6CA1\u6709\u627E\u5230\uFF0C\u5219\u521B\u5EFA\u5B83\u3002\u8FD9\u5BF9\u4E8E\u521B\u5EFA\u4F8B\u5982\u6811\u7ED3\u6784\u975E\u5E38\u65B9\u4FBF\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (y:Year {year: 2014})
MERGE (y)&lt;-[:IN_YEAR]-(m10:Month {month: 10})
MERGE (y)&lt;-[:IN_YEAR]-(m11:Month {month: 11})
RETURN y, m10, m11

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8FD9\u662F\u521B\u5EFA\u7684\u56FE\u5F62\u7ED3\u6784\uFF1A</p><p><img src="`+N+`" alt="\u5B9E\u8DF5\u4E2D\u7684\u5BC6\u7801\u4ECB\u7ECD\u6A21\u5F0F07" loading="lazy"></p><p>\u8FD9\u91CC\u6CA1\u6709\u5BF9\u8FD9\u4E24\u4E2A<code>Month</code>\u8282\u70B9\u8FDB\u884C\u5168\u5C40\u641C\u7D22\uFF1B\u4EC5\u5728_2014_ <code>Year</code>\u8282\u70B9\u7684\u4E0A\u4E0B\u6587\u4E2D\u641C\u7D22\u5B83\u4EEC\u3002</p><h3 id="\u8FD4\u56DE\u6B63\u786E\u7684\u7ED3\u679C" tabindex="-1"><a class="header-anchor" href="#\u8FD4\u56DE\u6B63\u786E\u7684\u7ED3\u679C" aria-hidden="true">#</a> \u8FD4\u56DE\u6B63\u786E\u7684\u7ED3\u679C</h3><h4 id="_1-\u793A\u4F8B\u56FE-1" tabindex="-1"><a class="header-anchor" href="#_1-\u793A\u4F8B\u56FE-1" aria-hidden="true">#</a> 1. \u793A\u4F8B\u56FE</h4><p>\u9996\u5148\uFF0C\u6211\u4EEC\u521B\u5EFA\u4E00\u4E9B\u6570\u636E\u7528\u4E8E\u6211\u4EEC\u7684\u793A\u4F8B\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (matrix:Movie {title: &#39;The Matrix&#39;, released: 1997})
CREATE (cloudAtlas:Movie {title: &#39;Cloud Atlas&#39;, released: 2012})
CREATE (forrestGump:Movie {title: &#39;Forrest Gump&#39;, released: 1994})
CREATE (keanu:Person {name: &#39;Keanu Reeves&#39;, born: 1964})
CREATE (robert:Person {name: &#39;Robert Zemeckis&#39;, born: 1951})
CREATE (tom:Person {name: &#39;Tom Hanks&#39;, born: 1956})
CREATE (tom)-[:ACTED_IN {roles: [&#39;Forrest&#39;]}]-&gt;(forrestGump)
CREATE (tom)-[:ACTED_IN {roles: [&#39;Zachry&#39;]}]-&gt;(cloudAtlas)
CREATE (robert)-[:DIRECTED]-&gt;(forrestGump)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8FD9\u662F\u7ED3\u679C\u56FE\uFF1A</p><p><img src="`+f+`" alt="\u5BC6\u7801\u4ECB\u7ECD\u7ED3\u679C01" loading="lazy"></p><h4 id="_2-\u8FC7\u6EE4\u7ED3\u679C" tabindex="-1"><a class="header-anchor" href="#_2-\u8FC7\u6EE4\u7ED3\u679C" aria-hidden="true">#</a> 2. \u8FC7\u6EE4\u7ED3\u679C</h4><p>\u5230\u76EE\u524D\u4E3A\u6B62\uFF0C\u6211\u4EEC\u5DF2\u7ECF\u5728\u56FE\u4E2D\u5339\u914D\u4E86\u6A21\u5F0F\uFF0C\u5E76\u4E14\u603B\u662F\u8FD4\u56DE\u6211\u4EEC\u627E\u5230\u7684\u6240\u6709\u7ED3\u679C\u3002\u73B0\u5728\u6211\u4EEC\u5C06\u7814\u7A76\u8FC7\u6EE4\u7ED3\u679C\u7684\u9009\u9879\uFF0C\u53EA\u8FD4\u56DE\u6211\u4EEC\u611F\u5174\u8DA3\u7684\u6570\u636E\u5B50\u96C6\u3002\u8FD9\u4E9B\u8FC7\u6EE4\u6761\u4EF6\u4F7F\u7528<code>WHERE</code>\u5B50\u53E5\u8868\u793A\u3002\u8FD9\u4E2A\u5B50\u53E5\u5141\u8BB8\u4F7F\u7528\u4EFB\u610F\u6570\u91CF\u7684\u5E03\u5C14\u8868\u8FBE\u5F0F\uFF0C\u7684_\u8C13\u8BCD_\uFF0C\u7ED3\u5408<code>AND</code>\uFF0C<code>OR</code>\uFF0C<code>XOR</code>\u548C<code>NOT</code>\u3002\u6700\u7B80\u5355\u7684\u8C13\u8BCD\u662F\u6BD4\u8F83\uFF1B\u5C24\u5176\u662F\u7B49\u4E8E\uFF08=\uFF09\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (m:Movie)
WHERE m.title = &#39;The Matrix&#39;
RETURN m


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 1

+------------------------------------------------+
| m                                              |
+------------------------------------------------+
| (:Movie {title: &#39;The Matrix&#39;, released: 1997}) |
+------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u4E0A\u9762\u7684\u67E5\u8BE2\uFF0C\u4F7F\u7528<code>WHERE</code>\u5B50\u53E5\uFF0C\u76F8\u5F53\u4E8E\u8FD9\u4E2A\u67E5\u8BE2\uFF0C\u5B83\u5728\u6A21\u5F0F\u5339\u914D\u4E2D\u5305\u542B\u6761\u4EF6\uFF1A</p><p><strong>Cypher</strong></p><p><code>MATCH (m:Movie {title: &#39;The Matrix&#39;}) RETURN m</code></p><p>\u5176\u4ED6\u9009\u9879\u5305\u62EC\u6570\u5B57\u6BD4\u8F83\u3001\u5339\u914D\u6B63\u5219\u8868\u8FBE\u5F0F\u4EE5\u53CA\u68C0\u67E5\u5217\u8868\u4E2D\u503C\u7684\u5B58\u5728\u3002</p><p><code>WHERE</code>\u4EE5\u4E0B\u793A\u4F8B\u4E2D\u7684\u5B50\u53E5\u5305\u62EC\u6B63\u5219\u8868\u8FBE\u5F0F\u5339\u914D\u3001\u5927\u4E8E\u6BD4\u8F83\u548C\u7528\u4E8E\u67E5\u770B\u5217\u8868\u4E2D\u662F\u5426\u5B58\u5728\u67D0\u4E2A\u503C\u7684\u6D4B\u8BD5\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (p:Person)-[r:ACTED_IN]-&gt;(m:Movie)
WHERE p.name =~ &#39;K.+&#39; OR m.released &gt; 2000 OR &#39;Neo&#39; IN r.roles
RETURN p, r, m


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 1

+-------------------------------------------------------------------------------------------------------------------------------+
| p                                         | r                               | m                                               |
+-------------------------------------------------------------------------------------------------------------------------------+
| (:Person {name: &#39;Tom Hanks&#39;, born: 1956}) | [:ACTED_IN {roles: [&#39;Zachry&#39;]}] | (:Movie {title: &#39;Cloud Atlas&#39;, released: 2012}) |
+-------------------------------------------------------------------------------------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u4E00\u4E2A\u9AD8\u7EA7\u65B9\u9762\u662F\u6A21\u5F0F\u53EF\u4EE5\u7528\u4F5C\u8C13\u8BCD\u3002\u5728<code>MATCH</code>\u6269\u5C55\u5339\u914D\u6A21\u5F0F\u7684\u6570\u91CF\u548C\u5F62\u72B6\u7684\u5730\u65B9\uFF0C\u6A21\u5F0F\u8C13\u8BCD\u9650\u5236\u5F53\u524D\u7ED3\u679C\u96C6\u3002\u5B83\u53EA\u5141\u8BB8\u6EE1\u8DB3\u6307\u5B9A\u6A21\u5F0F\u7684\u8DEF\u5F84\u901A\u8FC7\u3002\u6B63\u5982\u6211\u4EEC\u53EF\u4EE5\u9884\u671F\uFF0C\u91C7\u7528<code>NOT</code>\u53EA\u5141\u8BB8\u8DEF\u5F84\u4F20\u9012\u90A3\u4E9B_\u4E0D_\u7B26\u5408\u6307\u5B9A\u7684\u6A21\u5F0F\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (p:Person)-[:ACTED_IN]-&gt;(m)
WHERE NOT (p)-[:DIRECTED]-&gt;()
RETURN p, m


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 2

+----------------------------------------------------------------------------------------------+
| p                                         | m                                                |
+----------------------------------------------------------------------------------------------+
| (:Person {name: &#39;Tom Hanks&#39;, born: 1956}) | (:Movie {title: &#39;Cloud Atlas&#39;, released: 2012})  |
| (:Person {name: &#39;Tom Hanks&#39;, born: 1956}) | (:Movie {title: &#39;Forrest Gump&#39;, released: 1994}) |
+----------------------------------------------------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8FD4\u56DE\u56FE\u5982\u4E0B\uFF1A</p><p><img src="`+I+`" alt="image-20211206124226046" loading="lazy"></p><p>\u5728\u8FD9\u91CC\uFF0C\u6211\u4EEC\u627E\u5230\u6F14\u5458\uFF0C\u56E0\u4E3A\u4ED6\u4EEC\u5EFA\u7ACB\u4E86<code>ACTED_IN</code>\u5173\u7CFB\uFF0C\u4F46\u968F\u540E\u8DF3\u8FC7\u4E86<code>DIRECTED</code>\u4EFB\u4F55\u7535\u5F71\u4E2D\u7684\u90A3\u4E9B\u6F14\u5458\u3002</p><p>\u8FD8\u6709\u66F4\u9AD8\u7EA7\u7684\u8FC7\u6EE4\u65B9\u6CD5\uFF0C\u4F8B\u5982_\u5217\u8868\u8C13\u8BCD_\uFF0C\u6211\u4EEC\u5C06\u5728\u672C\u8282\u540E\u9762\u8BA8\u8BBA\u3002</p><h4 id="_3-\u8FD4\u56DE\u7ED3\u679C" tabindex="-1"><a class="header-anchor" href="#_3-\u8FD4\u56DE\u7ED3\u679C" aria-hidden="true">#</a> 3. \u8FD4\u56DE\u7ED3\u679C</h4><p>\u5230\u76EE\u524D\u4E3A\u6B62\uFF0C\u6211\u4EEC\u5DF2\u7ECF\u76F4\u63A5\u901A\u8FC7\u5B83\u4EEC\u7684\u53D8\u91CF\u8FD4\u56DE\u4E86\u8282\u70B9\u3001\u5173\u7CFB\u548C\u8DEF\u5F84\u3002\u4F46\u662F\uFF0C\u8BE5<code>RETURN</code>\u5B50\u53E5\u53EF\u4EE5\u8FD4\u56DE\u4EFB\u610F\u6570\u91CF\u7684\u8868\u8FBE\u5F0F\u3002\u4F46\u662F Cypher \u4E2D\u7684\u8868\u8FBE\u5F0F\u662F\u4EC0\u4E48\uFF1F</p><p>\u6700\u7B80\u5355\u7684\u8868\u8FBE\u5F0F\u662F\u6587\u5B57\u503C\u3002\u6587\u5B57\u503C\u7684\u793A\u4F8B\u5305\u62EC\uFF1A\u6570\u5B57\u3001\u5B57\u7B26\u4E32\u3001\u6570\u7EC4\uFF08\u4F8B\u5982\uFF1A\uFF09<code>[1,2,3]</code>\u548C\u6620\u5C04\uFF08\u4F8B\u5982\uFF1A\uFF09<code>{name: &#39;Tom Hanks&#39;, born:1964, movies: [&#39;Forrest Gump&#39;, ...], count: 13}</code>\u3002\u7684\u4EFB\u4F55\u8282\u70B9\uFF0C\u5173\u7CFB\u6216\u5730\u56FE\u5404\u4E2A\u5C5E\u6027\u53EF\u4EE5\u4F7F\u7528\u8BBF\u95EE_\u70B9\u8BED\u6CD5_\uFF0C\u4F8B\u5982\uFF1A<code>n.name</code>\u3002\u53EF\u4EE5\u4F7F\u7528\u4E0B\u6807\u68C0\u7D22\u5355\u4E2A\u5143\u7D20\u6216\u6570\u7EC4\u5207\u7247\uFF0C\u4F8B\u5982\uFF1A<code>names[0]</code>\u548C<code>movies[1..-1]</code>\u3002\u6BCF\u4E2A\u529F\u80FD\u7684\u8BC4\u4EF7\uFF0C\u4F8B\u5982\uFF1A<code>length(array)</code>\uFF0C<code>toInteger(&#39;12&#39;)</code>\uFF0C<code>substring(&#39;2014-07-01&#39;, 0, 4)</code>\u548C<code>coalesce(p.nickname, &#39;n/a&#39;)</code>\uFF0C\u4E5F\u662F\u4E00\u4E2A\u8868\u8FBE\u5F0F\u3002</p><p><code>WHERE</code>\u5B50\u53E5\u4E2D\u4F7F\u7528\u7684\u8C13\u8BCD\u7B97\u4F5C_\u5E03\u5C14\u8868\u8FBE\u5F0F_\u3002</p><p>\u53EF\u4EE5\u7EC4\u5408\u548C\u8FDE\u63A5\u7B80\u5355\u7684\u8868\u8FBE\u5F0F\u4EE5\u5F62\u6210\u66F4\u590D\u6742\u7684\u8868\u8FBE\u5F0F\u3002</p><p>\u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0C\u8868\u8FBE\u5F0F\u672C\u8EAB\u5C06\u7528\u4F5C\u5217\u7684\u6807\u7B7E\uFF0C\u5728\u8BB8\u591A\u60C5\u51B5\u4E0B\uFF0C\u60A8\u5E0C\u671B\u4F7F\u7528<code>expression AS alias</code>. \u968F\u540E\u53EF\u4EE5\u4F7F\u7528\u522B\u540D\u6765\u5F15\u7528\u8BE5\u5217\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (p:Person)
RETURN
  p,
  p.name AS name,
  toUpper(p.name),
  coalesce(p.nickname, &#39;n/a&#39;) AS nickname,
  {name: p.name, label: head(labels(p))} AS person


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 3

+-------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                               | name              | toUpper(p.name)   | nickname | person                                     |
+-------------------------------------------------------------------------------------------------------------------------------------------------+
| (:Person {name: &#39;Keanu Reeves&#39;, born: 1964})    | &#39;Keanu Reeves&#39;    | &#39;KEANU REEVES&#39;    | &#39;n/a&#39;    | {name: &#39;Keanu Reeves&#39;, label: &#39;Person&#39;}    |
| (:Person {name: &#39;Robert Zemeckis&#39;, born: 1951}) | &#39;Robert Zemeckis&#39; | &#39;ROBERT ZEMECKIS&#39; | &#39;n/a&#39;    | {name: &#39;Robert Zemeckis&#39;, label: &#39;Person&#39;} |
| (:Person {name: &#39;Tom Hanks&#39;, born: 1956})       | &#39;Tom Hanks&#39;       | &#39;TOM HANKS&#39;       | &#39;n/a&#39;    | {name: &#39;Tom Hanks&#39;, label: &#39;Person&#39;}       |
+-------------------------------------------------------------------------------------------------------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u5982\u679C\u6211\u4EEC\u5E0C\u671B\u53EA\u663E\u793A\u552F\u4E00\u7684\u7ED3\u679C\uFF0C\u6211\u4EEC\u53EF\u4EE5\u4F7F\u7528<code>DISTINCT</code>after \u5173\u952E\u5B57<code>RETURN</code>\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (n)
RETURN DISTINCT labels(n) AS Labels


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 2

+------------+
| Labels     |
+------------+
| [&#39;Movie&#39;]  |
| [&#39;Person&#39;] |
+------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><h4 id="_4-\u6C47\u603B\u4FE1\u606F" tabindex="-1"><a class="header-anchor" href="#_4-\u6C47\u603B\u4FE1\u606F" aria-hidden="true">#</a> 4. \u6C47\u603B\u4FE1\u606F</h4><p>\u5728\u8BB8\u591A\u60C5\u51B5\u4E0B\uFF0C\u6211\u4EEC\u5E0C\u671B\u5728\u904D\u5386\u56FE\u4E2D\u7684\u6A21\u5F0F\u65F6\u5BF9\u9047\u5230\u7684\u6570\u636E\u8FDB\u884C\u805A\u5408\u6216\u5206\u7EC4\u3002\u5728 Cypher \u4E2D\uFF0C\u805A\u5408\u53D1\u751F\u5728<code>RETURN</code>\u8BA1\u7B97\u6700\u7EC8\u7ED3\u679C\u7684\u5B50\u53E5\u4E2D\u3002\u8BB8\u591A\u5E38\u89C1\u7684\u805A\u96C6\u529F\u80FD\u7684\u652F\u6301\uFF0C\u4F8B\u5982<code>count</code>\uFF0C<code>sum</code>\uFF0C<code>avg</code>\uFF0C<code>min</code>\uFF0C\u548C<code>max</code>\uFF0C\u4F46\u4E5F\u6709\u51E0\u4E2A\u3002</p><p>\u53EF\u4EE5\u901A\u8FC7\u4EE5\u4E0B\u65B9\u5F0F\u8BA1\u7B97\u6570\u636E\u5E93\u4E2D\u7684\u4EBA\u6570\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (:Person)
RETURN count(*) AS people


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 1

+--------+
| people |
+--------+
| 3      |
+--------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8BF7\u6CE8\u610F\uFF0C<code>NULL</code>\u805A\u5408\u671F\u95F4\u4F1A\u8DF3\u8FC7\u503C\u3002\u8981\u4EC5\u805A\u5408\u552F\u4E00\u503C\uFF0C\u8BF7\u4F7F\u7528<code>DISTINCT</code>\uFF0C\u4F8B\u5982\uFF1A<code>count(DISTINCT role)</code>\u3002</p><p>\u805A\u5408\u5728 Cypher \u4E2D\u9690\u5F0F\u5DE5\u4F5C\u3002\u6211\u4EEC\u6307\u5B9A\u8981\u805A\u5408\u7684\u7ED3\u679C\u5217\u3002Cypher \u5C06\u4F7F\u7528\u6240\u6709\u975E\u805A\u5408\u5217\u4F5C\u4E3A\u5206\u7EC4\u952E\u3002</p><p>\u805A\u5408\u4F1A\u5F71\u54CD\u54EA\u4E9B\u6570\u636E\u5728\u6392\u5E8F\u6216\u7A0D\u540E\u7684\u67E5\u8BE2\u90E8\u5206\u4E2D\u4ECD\u7136\u53EF\u89C1\u3002</p><p>\u4E0B\u9762\u7684\u9648\u8FF0\u627E\u51FA\u4E86\u6F14\u5458\u548C\u5BFC\u6F14\u4E00\u8D77\u5DE5\u4F5C\u7684\u9891\u7387\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (actor:Person)-[:ACTED_IN]-&gt;(movie:Movie)&lt;-[:DIRECTED]-(director:Person)
RETURN actor, director, count(*) AS collaborations


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 1

+--------------------------------------------------------------------------------------------------------------+
| actor                                     | director                                        | collaborations |
+--------------------------------------------------------------------------------------------------------------+
| (:Person {name: &#39;Tom Hanks&#39;, born: 1956}) | (:Person {name: &#39;Robert Zemeckis&#39;, born: 1951}) | 1              |
+--------------------------------------------------------------------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><h4 id="_5-\u6392\u5E8F\u548C\u5206\u9875" tabindex="-1"><a class="header-anchor" href="#_5-\u6392\u5E8F\u548C\u5206\u9875" aria-hidden="true">#</a> 5. \u6392\u5E8F\u548C\u5206\u9875</h4><p>\u4F7F\u7528 \u805A\u5408\u540E\u8FDB\u884C\u6392\u5E8F\u548C\u5206\u9875\u662F\u5F88\u5E38\u89C1\u7684<code>count(x)</code>\u3002</p><p>\u4F7F\u7528<code>ORDER BY expression [ASC|DESC]</code>\u5B50\u53E5\u8FDB\u884C\u6392\u5E8F\u3002\u8868\u8FBE\u5F0F\u53EF\u4EE5\u662F\u4EFB\u4F55\u8868\u8FBE\u5F0F\uFF0C\u53EA\u8981\u5B83\u53EF\u4EE5\u4ECE\u8FD4\u56DE\u7684\u4FE1\u606F\u4E2D\u8BA1\u7B97\u51FA\u6765\u3002</p><p>\u4F8B\u5982\uFF0C\u5982\u679C\u6211\u4EEC\u8FD4\u56DE<code>person.name</code>\u6211\u4EEC\u4ECD\u7136\u53EF\u4EE5\uFF0C<code>ORDER BY person.age</code>\u56E0\u4E3A\u4E24\u8005\u90FD\u53EF\u4EE5\u4ECE<code>person</code>\u5F15\u7528\u4E2D\u8BBF\u95EE\u3002\u6211\u4EEC\u4E0D\u80FD\u6309\u672A\u9000\u56DE\u7684\u4E1C\u897F\u8BA2\u8D2D\u3002\u8FD9\u5BF9\u4E8E\u805A\u5408\u548C<code>DISTINCT</code>\u8FD4\u56DE\u503C\u5C24\u5176\u91CD\u8981\uFF0C\u56E0\u4E3A\u4E24\u8005\u90FD\u4F1A\u6D88\u9664\u805A\u5408\u6570\u636E\u7684\u53EF\u89C1\u6027\u3002</p><p>\u5206\u9875\u662F\u4F7F\u7528<code>SKIP {offset}</code>and<code>LIMIT {count}</code>\u5B50\u53E5\u5B8C\u6210\u7684\u3002</p><p>\u4E00\u4E2A\u5E38\u89C1\u7684\u6A21\u5F0F\u662F\u805A\u5408\u4E00\u4E2A\u8BA1\u6570\uFF08<em>score_\u6216_frequency</em>\uFF09\uFF0C\u6309\u5B83\u6392\u5E8F\uFF0C\u7136\u540E\u53EA\u8FD4\u56DE top-n \u6761\u76EE\u3002</p><p>\u4F8B\u5982\uFF0C\u4E3A\u4E86\u627E\u5230\u6211\u4EEC\u53EF\u4EE5\u505A\u7684\u6700\u591A\u4EA7\u7684\u6F14\u5458\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (a:Person)-[:ACTED_IN]-&gt;(m:Movie)
RETURN a, count(*) AS appearances
ORDER BY appearances DESC LIMIT 10


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 1

+---------------------------------------------------------+
| a                                         | appearances |
+---------------------------------------------------------+
| (:Person {name: &#39;Tom Hanks&#39;, born: 1956}) | 2           |
+---------------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><h4 id="_6-\u91C7\u96C6\u805A\u5408" tabindex="-1"><a class="header-anchor" href="#_6-\u91C7\u96C6\u805A\u5408" aria-hidden="true">#</a> 6. \u91C7\u96C6\u805A\u5408</h4><p>\u4E00\u4E2A\u975E\u5E38\u6709\u7528\u7684\u805A\u5408\u51FD\u6570\u662F<code>collect()</code>\uFF0C\u5B83\u5C06\u6240\u6709\u805A\u5408\u503C\u6536\u96C6\u5230\u4E00\u4E2A\u5217\u8868\u4E2D\u3002\u8FD9\u5728\u8BB8\u591A\u60C5\u51B5\u4E0B\u975E\u5E38\u6709\u7528\uFF0C\u56E0\u4E3A\u5728\u805A\u5408\u65F6\u4E0D\u4F1A\u4E22\u5931\u4EFB\u4F55\u7EC6\u8282\u4FE1\u606F\u3002</p><p><code>collect()</code>\u975E\u5E38\u9002\u5408\u68C0\u7D22\u5178\u578B\u7684\u7236\u5B50\u7ED3\u6784\uFF0C\u5176\u4E2D\u6BCF\u884C\u8FD4\u56DE\u4E00\u4E2A\u6838\u5FC3\u5B9E\u4F53\uFF08<em>parent</em>\u3001<em>root_\u6216_head</em>\uFF09\u53CA\u5176\u6240\u6709\u76F8\u5173\u4FE1\u606F\uFF0C\u8FD9\u4E9B\u4FE1\u606F\u4F4D\u4E8E\u7528<code>collect()</code>. \u8FD9\u610F\u5473\u7740\u65E0\u9700\u4E3A\u6BCF\u4E2A\u5B50\u884C\u91CD\u590D\u7236\u4FE1\u606F\uFF0C\u4E5F\u65E0\u9700\u8FD0\u884C<code>n+1</code>\u8BED\u53E5\u6765\u5206\u522B\u68C0\u7D22\u7236\u884C\u53CA\u5176\u5B50\u884C\u3002</p><p>\u4EE5\u4E0B\u8BED\u53E5\u53EF\u7528\u4E8E\u68C0\u7D22\u6211\u4EEC\u6570\u636E\u5E93\u4E2D\u6BCF\u90E8\u7535\u5F71\u7684\u6F14\u5458\u8868\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (m:Movie)&lt;-[:ACTED_IN]-(a:Person)
RETURN m.title AS movie, collect(a.name) AS cast, count(*) AS actors


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 2

+-----------------------------------------+
| movie          | cast          | actors |
+-----------------------------------------+
| &#39;Forrest Gump&#39; | [&#39;Tom Hanks&#39;] | 1      |
| &#39;Cloud Atlas&#39;  | [&#39;Tom Hanks&#39;] | 1      |
+-----------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u521B\u5EFA\u7684\u5217\u8868<code>collect()</code>\u53EF\u4EE5\u4ECE\u4F7F\u7528 Cypher \u7ED3\u679C\u7684\u5BA2\u6237\u7AEF\u4F7F\u7528\uFF0C\u4E5F\u53EF\u4EE5\u76F4\u63A5\u5728\u5177\u6709\u4EFB\u4F55\u5217\u8868\u51FD\u6570\u6216\u8C13\u8BCD\u7684\u8BED\u53E5\u4E2D\u4F7F\u7528\u3002</p><h3 id="\u7F16\u5199\u590D\u6742\u8BED\u53E5" tabindex="-1"><a class="header-anchor" href="#\u7F16\u5199\u590D\u6742\u8BED\u53E5" aria-hidden="true">#</a> \u7F16\u5199\u590D\u6742\u8BED\u53E5</h3><h4 id="_1-\u793A\u4F8B\u56FE-example-graph" tabindex="-1"><a class="header-anchor" href="#_1-\u793A\u4F8B\u56FE-example-graph" aria-hidden="true">#</a> 1. \u793A\u4F8B\u56FE( Example graph)</h4><p>\u6211\u4EEC\u7EE7\u7EED\u4F7F\u7528\u4E0E\u4E4B\u524D\u76F8\u540C\u7684\u793A\u4F8B\u6570\u636E\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (matrix:Movie {title: &#39;The Matrix&#39;, released: 1997})
CREATE (cloudAtlas:Movie {title: &#39;Cloud Atlas&#39;, released: 2012})
CREATE (forrestGump:Movie {title: &#39;Forrest Gump&#39;, released: 1994})
CREATE (keanu:Person {name: &#39;Keanu Reeves&#39;, born: 1964})
CREATE (robert:Person {name: &#39;Robert Zemeckis&#39;, born: 1951})
CREATE (tom:Person {name: &#39;Tom Hanks&#39;, born: 1956})
CREATE (tom)-[:ACTED_IN {roles: [&#39;Forrest&#39;]}]-&gt;(forrestGump)
CREATE (tom)-[:ACTED_IN {roles: [&#39;Zachry&#39;]}]-&gt;(cloudAtlas)
CREATE (robert)-[:DIRECTED]-&gt;(forrestGump)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8FD9\u662F\u7ED3\u679C\u56FE\uFF1A</p><p><img src="`+M+`" alt="\u5BC6\u7801\u4ECB\u7ECD\u5927\u8BED\u53E501" loading="lazy"></p><h4 id="_2-union" tabindex="-1"><a class="header-anchor" href="#_2-union" aria-hidden="true">#</a> 2. UNION</h4><p>\u5982\u679C\u8981\u5408\u5E76\u5177\u6709\u76F8\u540C\u7ED3\u679C\u7ED3\u6784\u7684\u4E24\u4E2A\u8BED\u53E5\u7684\u7ED3\u679C\uFF0C\u53EF\u4EE5\u4F7F\u7528 \u3002<code>UNION [ALL]</code></p><p>\u4F8B\u5982\uFF0C\u4EE5\u4E0B\u8BED\u53E5\u540C\u65F6\u5217\u51FA\u4E86\u6F14\u5458\u548C\u5BFC\u6F14\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (actor:Person)-[r:ACTED_IN]-&gt;(movie:Movie)
RETURN actor.name AS name, type(r) AS type, movie.title AS title
UNION
MATCH (director:Person)-[r:DIRECTED]-&gt;(movie:Movie)
RETURN director.name AS name, type(r) AS type, movie.title AS title


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 3

+-------------------------------------------------+
| name              | type       | title          |
+-------------------------------------------------+
| &#39;Tom Hanks&#39;       | &#39;ACTED_IN&#39; | &#39;Cloud Atlas&#39;  |
| &#39;Tom Hanks&#39;       | &#39;ACTED_IN&#39; | &#39;Forrest Gump&#39; |
| &#39;Robert Zemeckis&#39; | &#39;DIRECTED&#39; | &#39;Forrest Gump&#39; |
+-------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8BF7\u6CE8\u610F\uFF0C\u5728\u6240\u6709\u5B50\u53E5\u4E2D\uFF0C\u8FD4\u56DE\u7684\u5217\u5FC5\u987B\u4EE5\u76F8\u540C\u7684\u65B9\u5F0F\u547D\u540D\u3002</p><p>\u4E0A\u9762\u7684\u67E5\u8BE2\u7B49\u6548\u4E8E\u8FD9\u4E2A\u66F4\u7D27\u51D1\u7684\u67E5\u8BE2\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (actor:Person)-[r:ACTED_IN|DIRECTED]-&gt;(movie:Movie) RETURN actor.name AS name, type(r) AS type, movie.title AS title

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><h4 id="_3-with" tabindex="-1"><a class="header-anchor" href="#_3-with" aria-hidden="true">#</a> 3. WITH</h4><p>\u5728Cypher\u4E2D\uFF0C\u53EF\u4EE5\u5C06\u8BED\u53E5\u7247\u6BB5\u94FE\u63A5\u5728\u4E00\u8D77\uFF0C\u7C7B\u4F3C\u4E8E\u5728\u6570\u636E\u6D41\u7BA1\u9053\u4E2D\u5B8C\u6210\u7684\u65B9\u5F0F\u3002\u6BCF\u4E2A\u7247\u6BB5\u90FD\u5904\u7406\u524D\u4E00\u4E2A\u7247\u6BB5\u7684\u8F93\u51FA\uFF0C\u5176\u7ED3\u679C\u53EF\u4EE5\u9988\u9001\u5230\u4E0B\u4E00\u4E2A\u7247\u6BB5\u3002_\u53EA\u6709_\u5B50\u53E5\u4E2D\u58F0\u660E\u7684\u5217\u5728\u540E\u7EED\u67E5\u8BE2\u90E8\u5206\u4E2D\u53EF\u7528\u3002<code>WITH</code></p><p>\u8BE5\u5B50\u53E5\u7528\u4E8E\u7EC4\u5408\u5404\u4E2A\u90E8\u5206\uFF0C\u5E76\u58F0\u660E\u54EA\u4E9B\u6570\u636E\u4ECE\u4E00\u4E2A\u90E8\u5206\u6D41\u5411\u53E6\u4E00\u4E2A\u90E8\u5206\u3002 \u7C7B\u4F3C\u4E8E\u5B50\u53E5\u3002\u4E0D\u540C\u4E4B\u5904\u5728\u4E8E\uFF0C\u5B50\u53E5\u4E0D\u4F1A\u5B8C\u6210\u67E5\u8BE2\uFF0C\u800C\u662F\u4E3A\u4E0B\u4E00\u90E8\u5206\u51C6\u5907\u8F93\u5165\u3002\u8868\u8FBE\u5F0F\u3001\u805A\u5408\u3001\u6392\u5E8F\u548C\u5206\u9875\u7684\u4F7F\u7528\u65B9\u5F0F\u4E0E\u5B50\u53E5\u4E2D\u7684\u4F7F\u7528\u65B9\u5F0F\u76F8\u540C\u3002\u552F\u4E00\u7684\u533A\u522B\u662F\u6240\u6709\u5217\u90FD\u5FC5\u987B\u6709\u522B\u540D\u3002<code>WITH\`\`WITH\`\`RETURN\`\`WITH\`\`RETURN</code></p><p>\u5728\u4E0B\u9762\u7684\u793A\u4F8B\u4E2D\uFF0C\u6211\u4EEC\u6536\u96C6\u4E86\u67D0\u4EBA\u51FA\u6F14\u7684\u7535\u5F71\uFF0C\u7136\u540E\u8FC7\u6EE4\u6389\u90A3\u4E9B\u53EA\u51FA\u73B0\u5728\u4E00\u90E8\u7535\u5F71\u4E2D\u7684\u7535\u5F71\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (person:Person)-[:ACTED_IN]-&gt;(m:Movie)
WITH person, count(*) AS appearances, collect(m.title) AS movies
WHERE appearances &gt; 1
RETURN person.name, appearances, movies


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 1

+-------------------------------------------------------------+
| person.name | appearances | movies                          |
+-------------------------------------------------------------+
| &#39;Tom Hanks&#39; | 2           | [&#39;Cloud Atlas&#39;, &#39;Forrest Gump&#39;] |
+-------------------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><h3 id="\u5B9A\u4E49\u6A21\u5F0F" tabindex="-1"><a class="header-anchor" href="#\u5B9A\u4E49\u6A21\u5F0F" aria-hidden="true">#</a> \u5B9A\u4E49\u6A21\u5F0F</h3><h4 id="_1-\u793A\u4F8B\u56FE-2" tabindex="-1"><a class="header-anchor" href="#_1-\u793A\u4F8B\u56FE-2" aria-hidden="true">#</a> 1. \u793A\u4F8B\u56FE</h4><p>\u9996\u5148\u521B\u5EFA\u4E00\u4E9B\u6570\u636E\u7528\u4E8E\u6211\u4EEC\u7684\u793A\u4F8B\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE (forrestGump:Movie {title: &#39;Forrest Gump&#39;, released: 1994})
CREATE (robert:Person:Director {name: &#39;Robert Zemeckis&#39;, born: 1951})
CREATE (tom:Person:Actor {name: &#39;Tom Hanks&#39;, born: 1956})
CREATE (tom)-[:ACTED_IN {roles: [&#39;Forrest&#39;]}]-&gt;(forrestGump)
CREATE (robert)-[:DIRECTED]-&gt;(forrestGump)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8FD9\u662F\u7ED3\u679C\u56FE\uFF1A</p><p><img src="`+S+`" alt="\u5BC6\u7801\u4ECB\u7ECD\u6A21\u5F0F\u6570\u636E" loading="lazy"></p><h4 id="_2-\u4F7F\u7528\u7D22\u5F15" tabindex="-1"><a class="header-anchor" href="#_2-\u4F7F\u7528\u7D22\u5F15" aria-hidden="true">#</a> 2. \u4F7F\u7528\u7D22\u5F15</h4><p>\u5728\u56FE\u6570\u636E\u5E93\u4E2D\u4F7F\u7528\u7D22\u5F15\u7684\u4E3B\u8981\u539F\u56E0\u662F\u4E3A\u4E86\u627E\u5230\u56FE\u904D\u5386\u7684\u8D77\u70B9\u3002\u4E00\u65E6\u627E\u5230\u8BE5\u8D77\u70B9\uFF0C\u904D\u5386\u5C31\u4F9D\u8D56\u4E8E\u56FE\u5185\u7ED3\u6784\u6765\u5B9E\u73B0\u9AD8\u6027\u80FD\u3002</p><p>\u53EF\u4EE5\u968F\u65F6\u6DFB\u52A0\u7D22\u5F15\u3002</p><p>\u5982\u679C\u6570\u636E\u5E93\u4E2D\u5DF2\u6709\u6570\u636E\uFF0C\u5219\u7D22\u5F15\u4E0A\u7EBF\u9700\u8981\u4E00\u4E9B\u65F6\u95F4\u3002</p><p>\u4EE5\u4E0B\u67E5\u8BE2\u521B\u5EFA\u4E00\u4E2A\u7D22\u5F15\u4EE5\u52A0\u5FEB\u5728\u6570\u636E\u5E93\u4E2D\u6309\u540D\u79F0\u67E5\u627E\u6F14\u5458\u7684\u901F\u5EA6\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE INDEX example_index_1 FOR (a:Actor) ON (a.name)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p>\u5728\u5927\u591A\u6570\u60C5\u51B5\u4E0B\uFF0C\u67E5\u8BE2\u6570\u636E\u65F6\u4E0D\u9700\u8981\u6307\u5B9A\u7D22\u5F15\uFF0C\u56E0\u4E3A\u5C06\u81EA\u52A8\u4F7F\u7528\u9002\u5F53\u7684\u7D22\u5F15\u3002</p>`,217),Re={href:"https://neo4j.com/docs/cypher-manual/4.4/query-tuning/#query-tuning",target:"_blank",rel:"noopener noreferrer"},ye=s(`<p>\u4F8B\u5982\uFF0C\u4EE5\u4E0B\u67E5\u8BE2\u5C06\u81EA\u52A8\u4F7F\u7528<code>example_index_1</code>\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (actor:Actor {name: &#39;Tom Hanks&#39;})
RETURN actor

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p><strong>A</strong> \u7EFC\u5408\u6307\u6570\u662F\u5BF9\u5177\u6709\u7279\u5B9A\u6807\u7B7E\u7684\u6240\u6709\u8282\u70B9\u7684\u591A\u4E2A\u5C5E\u6027\u7684\u7D22\u5F15\u3002\u4F8B\u5982\uFF0C\u4EE5\u4E0B\u8BED\u53E5\u5C06\u5728\u6240\u6709\u6807\u6709<code>Actor</code>\u548C \u4E14\u540C\u65F6\u5177\u6709 a<code>name</code>\u548C a<code>born</code>\u5C5E\u6027\u7684\u8282\u70B9\u4E0A\u521B\u5EFA\u4E00\u4E2A\u590D\u5408\u7D22\u5F15\u3002\u8BF7\u6CE8\u610F\uFF0C\u7531\u4E8E<code>Actor</code>\u6807\u7B7E<code>name</code>\u4E3A\u201C\u57FA\u52AA\xB7\u91CC\u7EF4\u65AF\u201D\u7684\u8282\u70B9\u4E0D\u5177\u6709\u8BE5<code>born</code>\u5C5E\u6027\u3002\u56E0\u6B64\u8BE5\u8282\u70B9\u4E0D\u4F1A\u88AB\u6DFB\u52A0\u5230\u7D22\u5F15\u4E2D\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE INDEX example_index_2 FOR (a:Actor) ON (a.name, a.born)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p>\u60A8\u53EF\u4EE5\u67E5\u8BE2\u6570\u636E\u5E93<code>SHOW INDEXES</code>\u4EE5\u627E\u51FA\u5B9A\u4E49\u4E86\u54EA\u4E9B\u7D22\u5F15\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>SHOW INDEXES YIELD name, labelsOrTypes, properties, type


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 2

+----------------------------------------------------------------+
| name              | labelsOrTypes | properties       | type    |
+----------------------------------------------------------------+
| &#39;example_index_1&#39; | [&#39;Actor&#39;]     | [&#39;name&#39;]         | &#39;BTREE&#39; |
| &#39;example_index_2&#39; | [&#39;Actor&#39;]     | [&#39;name&#39;, &#39;born&#39;] | &#39;BTREE&#39; |
+----------------------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div>`,10),Ae={href:"https://neo4j.com/docs/cypher-manual/4.4/indexes-for-full-text-search/#administration-indexes-fulltext-search",target:"_blank",rel:"noopener noreferrer"},Ne=s(`<h4 id="_3-\u4F7F\u7528\u7EA6\u675F" tabindex="-1"><a class="header-anchor" href="#_3-\u4F7F\u7528\u7EA6\u675F" aria-hidden="true">#</a> 3. \u4F7F\u7528\u7EA6\u675F</h4><p>\u7EA6\u675F\u7528\u4E8E\u786E\u4FDD\u6570\u636E\u7B26\u5408\u57DF\u7684\u89C4\u5219\u3002\u4F8B\u5982\uFF1A</p><blockquote><p>\u201C\u5982\u679C\u4E00\u4E2A\u8282\u70B9\u7684\u6807\u7B7E\u4E3A<code>Actor</code>\uFF0C\u5C5E\u6027\u4E3A<code>name</code>\uFF0C\u5219 \u7684\u503C<code>name</code>\u5728\u6240\u6709\u5177\u6709<code>Actor</code>\u6807\u7B7E\u7684\u8282\u70B9\u4E2D\u5FC5\u987B\u662F\u552F\u4E00\u7684\u201D\u3002</p></blockquote><p>\u793A\u4F8B 1. \u552F\u4E00\u6027\u7EA6\u675F</p><p>\u6B64\u793A\u4F8B\u663E\u793A\u5982\u4F55\u4E3A\u5177\u6709\u6807\u7B7E<code>Movie</code>\u548C\u5C5E\u6027\u7684\u8282\u70B9\u521B\u5EFA\u7EA6\u675F<code>title</code>\u3002\u7EA6\u675F\u6307\u5B9A<code>title</code>\u5C5E\u6027\u5FC5\u987B\u662F\u552F\u4E00\u7684\u3002</p><p>\u6DFB\u52A0\u552F\u4E00\u7EA6\u675F\u5C06\u9690\u5F0F\u6DFB\u52A0\u8BE5\u5C5E\u6027\u7684\u7D22\u5F15\u3002\u5982\u679C\u5220\u9664\u4E86\u7EA6\u675F\uFF0C\u4F46\u4ECD\u7136\u9700\u8981\u7D22\u5F15\uFF0C\u5219\u5FC5\u987B\u663E\u5F0F\u521B\u5EFA\u7D22\u5F15\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE CONSTRAINT constraint_example_1 FOR (movie:Movie) REQUIRE movie.title IS UNIQUE

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p>Neo4j 4.4 \u4E2D\u7684\u8BED\u6CD5\u53D1\u751F\u4E86\u53D8\u5316\uFF0C\u65E7\u7684\u8BED\u6CD5\u662F\uFF1A<code>CREATE CONSTRAINT constraint_example_1 ON (movie:Movie) ASSERT movie.title IS UNIQUE Deprecated</code></p><p>\u53EF\u4EE5\u5C06\u7EA6\u675F\u6DFB\u52A0\u5230\u5DF2\u7ECF\u6709\u6570\u636E\u7684\u6570\u636E\u5E93\u4E2D\u3002\u8FD9\u8981\u6C42\u73B0\u6709\u6570\u636E\u7B26\u5408\u6B63\u5728\u6DFB\u52A0\u7684\u7EA6\u675F\u3002</p><p>\u60A8\u53EF\u4EE5\u67E5\u8BE2\u6570\u636E\u5E93\u4EE5\u627E\u51FA\u4F7F\u7528<code>SHOW CONSTRAINTS</code>Cypher \u8BED\u6CD5\u5B9A\u4E49\u7684\u7EA6\u675F\u3002</p><p>\u793A\u4F8B 2. \u7EA6\u675F\u67E5\u8BE2</p><p>\u6B64\u793A\u4F8B\u663E\u793A\u4E86\u4E00\u4E2A Cypher \u67E5\u8BE2\uFF0C\u8BE5\u67E5\u8BE2\u8FD4\u56DE\u5DF2\u4E3A\u6570\u636E\u5E93\u5B9A\u4E49\u7684\u7EA6\u675F\u3002</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>SHOW CONSTRAINTS YIELD id, name, type, entityType, labelsOrTypes, properties, ownedIndexId


</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Rows: 1

+-----------------------------------------------------------------------------------------------------+
| id | name                   | type         | entityType | labelsOrTypes | properties | ownedIndexId |
+-----------------------------------------------------------------------------------------------------+
| 4  | &#39;constraint_example_1&#39; | &#39;UNIQUENESS&#39; | &#39;NODE&#39;     | [&#39;Movie&#39;]     | [&#39;title&#39;]  | 3            |
+-----------------------------------------------------------------------------------------------------+

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u4E0A\u8FF0\u7EA6\u675F\u9002\u7528\u4E8E Neo4j \u7684\u6240\u6709\u7248\u672C\u3002Neo4j \u4F01\u4E1A\u7248\u6709\u989D\u5916\u7684\u9650\u5236\u3002</p>`,17),fe={href:"https://neo4j.com/docs/cypher-manual/4.4/constraints/#administration-constraints",target:"_blank",rel:"noopener noreferrer"},Ie=s('<h3 id="\u5BFC\u5165\u6570\u636E" tabindex="-1"><a class="header-anchor" href="#\u5BFC\u5165\u6570\u636E" aria-hidden="true">#</a> \u5BFC\u5165\u6570\u636E</h3><blockquote><p>\u672C\u6559\u7A0B\u6F14\u793A\u4E86\u5982\u4F55\u4F7F\u7528 .csv \u6587\u4EF6\u4ECE CSV \u6587\u4EF6\u5BFC\u5165\u6570\u636E<code>LOAD CSV</code>\u3002</p></blockquote><p>\u7ED3\u5408 Cypher \u5B50\u53E5<code>LOAD CSV</code>, <code>MERGE</code>, \u548C<code>CREATE</code>\u60A8\u53EF\u4EE5\u65B9\u4FBF\u5730\u5C06\u6570\u636E\u5BFC\u5165 Neo4j\u3002 <code>LOAD CSV</code>\u5141\u8BB8\u60A8\u8BBF\u95EE\u6570\u636E\u503C\u5E76\u5BF9\u5176\u6267\u884C\u64CD\u4F5C\u3002</p>',3),Me=e("code",null,"LOAD CSV",-1),Se={href:"https://neo4j.com/docs/cypher-manual/4.4/clauses/load-csv/#query-load-csv",target:"_blank",rel:"noopener noreferrer"},je=e("code",null,"LOAD CSV",-1),De={href:"https://neo4j.com/docs/cypher-manual/4.4/clauses/#query-clause",target:"_blank",rel:"noopener noreferrer"},ke=s(`<h4 id="_1-\u6570\u636E\u6587\u4EF6" tabindex="-1"><a class="header-anchor" href="#_1-\u6570\u636E\u6587\u4EF6" aria-hidden="true">#</a> 1. \u6570\u636E\u6587\u4EF6</h4><p>\u5728\u672C\u6559\u7A0B\u4E2D\uFF0C\u60A8\u5C06\u4ECE\u4EE5\u4E0B CSV \u6587\u4EF6\u5BFC\u5165\u6570\u636E\uFF1A</p><ul><li><em>persons.csv</em></li><li><em>movies.csv</em></li><li><em>roles.csv</em></li></ul><p>_people.csv_\u6587\u4EF6\u7684\u5185\u5BB9\uFF1A</p><p>persons.csv</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>id,name
1,Charlie Sheen
2,Michael Douglas
3,Martin Sheen
4,Morgan Freeman

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8BE5_persons.csv_\u6587\u4EF6\u5305\u542B\u4E24\u5217<code>id</code>\u548C<code>name</code>\u3002\u6BCF\u4E00\u884C\u4EE3\u8868\u4E00\u4E2A\u4EBA\uFF0C\u4ED6\u6709\u4E00\u4E2A\u552F\u4E00\u7684<code>id</code>\u548C\u4E00\u4E2A<code>name</code>\u3002</p><p>_movies.csv_\u6587\u4EF6\u7684\u5185\u5BB9\uFF1A</p><p>movies.csv</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>id,title,country,year
1,Wall Street,USA,1987
2,The American President,USA,1995
3,The Shawshank Redemption,USA,1994

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8BE5_movies.csv_\u6587\u4EF6\u5305\u542B\u5217<code>id</code>\uFF0C<code>title</code>\uFF0C<code>country</code>\uFF0C\u548C<code>year</code>\u3002\u6BCF\u4E00\u884C\u4EE3\u8868\u4E00\u90E8\u7535\u5F71\uFF0C\u5B83\u6709\u4E00\u4E2A unique <code>id</code>\u3001 a <code>title</code>\u3001 a <code>country</code>of origin \u548C a release <code>year</code>\u3002</p><p>_roles.csv_\u6587\u4EF6\u7684\u5185\u5BB9\uFF1A</p><p>\u89D2\u8272.csv</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>personId,movieId,role
1,1,Bud Fox
4,1,Carl Fox
3,1,Gordon Gekko
4,2,A.J. MacInerney
3,2,President Andrew Shepherd
5,3,Ellis Boyd &#39;Red&#39; Redding

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>\u8BE5_roles.csv_\u6587\u4EF6\u5305\u542B\u5217<code>personId</code>\uFF0C<code>movieId</code>\u548C<code>role</code>\u3002\u6BCF\u4E00\u884C\u4EE3\u8868\u4E0E\u6709\u5173\u7684\u4EBA\u7684\u5173\u7CFB\u6570\u636E\u7684\u4E00\u4E2A\u89D2\u8272<code>id</code>\uFF08\u4ECE_persons.csv_\u6587\u4EF6\uFF09\u548C\u7535\u5F71<code>id</code>\uFF08\u4ECE_movies.csv_\u6587\u4EF6\uFF09\u3002</p><h4 id="_2-\u56FE\u6A21\u578B" tabindex="-1"><a class="header-anchor" href="#_2-\u56FE\u6A21\u578B" aria-hidden="true">#</a> 2. \u56FE\u6A21\u578B</h4><p>\u4EE5\u4E0B\u7B80\u5355\u6570\u636E\u6A21\u578B\u663E\u793A\u4E86\u6B64\u6570\u636E\u96C6\u7684\u56FE\u5F62\u6A21\u578B\u53EF\u80FD\u662F\u4EC0\u4E48\u6837\u5B50\uFF1A</p><p><img src="`+j+'" alt="\u5F00\u59CB\u52A0\u8F7D csv01" loading="lazy"></p><p>\u8FD9\u662F\u57FA\u4E8E CSV \u6587\u4EF6\u6570\u636E\u7684\u7ED3\u679C\u56FE\uFF1A</p><p><img src="'+D+'" alt="\u5F00\u59CB\u52A0\u8F7D csv02" loading="lazy"></p><h4 id="_3-\u5148\u51B3\u6761\u4EF6" tabindex="-1"><a class="header-anchor" href="#_3-\u5148\u51B3\u6761\u4EF6" aria-hidden="true">#</a> 3. \u5148\u51B3\u6761\u4EF6</h4><p>\u672C\u6559\u7A0B\u4F7F\u7528 Linux \u6216 macOS tarball \u5B89\u88C5\u3002</p><p>\u5B83\u5047\u8BBE\u60A8\u5F53\u524D\u7684\u5DE5\u4F5C\u76EE\u5F55\u662Ftarball \u5B89\u88C5\u7684\u76EE\u5F55\uFF0C\u5E76\u4E14 CSV \u6587\u4EF6\u653E\u7F6E\u5728\u9ED8\u8BA4_\u5BFC\u5165_\u76EE\u5F55\u4E2D\u3002</p>',26),He={href:"https://neo4j.com/docs/operations-manual/4.4/configuration/file-locations/#file-locations",target:"_blank",rel:"noopener noreferrer"},Oe={href:"https://neo4j.com/docs/operations-manual/4.4/reference/configuration-settings/#config_dbms.directories.import",target:"_blank",rel:"noopener noreferrer"},Pe=e("code",null,"dbms.directories.import",-1),qe=s(`<h4 id="_4-\u51C6\u5907\u6570\u636E\u5E93" tabindex="-1"><a class="header-anchor" href="#_4-\u51C6\u5907\u6570\u636E\u5E93" aria-hidden="true">#</a> 4.\u51C6\u5907\u6570\u636E\u5E93</h4><p>\u5728\u5BFC\u5165\u6570\u636E\u4E4B\u524D\uFF0C\u60A8\u5E94\u8BE5\u901A\u8FC7\u521B\u5EFA\u7D22\u5F15\u548C\u7EA6\u675F\u6765\u51C6\u5907\u8981\u4F7F\u7528\u7684\u6570\u636E\u5E93\u3002</p><p>\u60A8\u5E94\u8BE5\u901A\u8FC7\u5BF9<code>Person</code>\u548C<code>Movie</code>\u8282\u70B9<code>id</code>\u521B\u5EFA\u7EA6\u675F\u6765\u786E\u4FDD\u5B83\u4EEC\u5177\u6709\u552F\u4E00\u7684\u5C5E\u6027\u3002</p><p>\u521B\u5EFA\u552F\u4E00\u7EA6\u675F\u4E5F\u4F1A\u9690\u5F0F\u521B\u5EFA\u7D22\u5F15\u3002\u901A\u8FC7\u7D22\u5F15<code>id</code>\u5C5E\u6027\uFF0C\u8282\u70B9\u67E5\u627E\uFF08\u4F8B\u5982 by <code>MATCH</code>\uFF09\u4F1A\u5FEB\u5F97\u591A\u3002</p><p>\u6B64\u5916\uFF0C\u6700\u597D\u4E3A\u56FD\u5BB6/\u5730\u533A<code>name</code>\u5EFA\u7ACB\u7D22\u5F15\u4EE5\u8FDB\u884C\u5FEB\u901F\u67E5\u627E\u3002</p><p><strong>1\u3001\u542F\u52A8neo4j\u3002</strong></p><p><strong>Shell</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>bin/neo4j start

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p>\u9ED8\u8BA4\u7528\u6237\u540D\u662F<code>neo4j</code>\u548C\u5BC6\u7801<code>neo4j</code>\u3002</p><p><strong>2. \u521B\u5EFA\u4E00\u4E2A\u7EA6\u675F\uFF0C\u4F7F\u6BCF\u4E2A<code>Person</code>\u8282\u70B9\u90FD\u6709\u4E00\u4E2A\u552F\u4E00\u7684<code>id</code>\u5C5E\u6027\u3002</strong></p><p>\u60A8<code>id</code>\u5BF9<code>Person</code>\u8282\u70B9\u7684\u5C5E\u6027\u521B\u5EFA\u7EA6\u675F\u4EE5\u786E\u4FDD\u5E26\u6709<code>Person</code>\u6807\u7B7E\u7684\u8282\u70B9\u5C06\u5177\u6709\u552F\u4E00\u7684<code>id</code>\u5C5E\u6027\u3002</p><p>\u4F7F\u7528_Neo4j \u6D4F\u89C8\u5668_\uFF0C\u8FD0\u884C\u4EE5\u4E0B Cypher\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE CONSTRAINT personIdConstraint FOR (person:Person) REQUIRE person.id IS UNIQUE

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div>`,14),Ue={href:"https://neo4j.com/docs/operations-manual/4.4/tools/cypher-shell/#cypher-shell",target:"_blank",rel:"noopener noreferrer"},Le=e("em",null,"Neo4j Cypher Shell",-1),Ge=s(`<p><strong>Shell</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>bin/cypher-shell --database=neo4j &quot;CREATE CONSTRAINT personIdConstraint FOR (person:Person) REQUIRE person.id IS UNIQUE&quot;

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p><strong>3. \u521B\u5EFA\u4E00\u4E2A\u7EA6\u675F\uFF0C\u4F7F\u6BCF\u4E2A<code>Movie</code>\u8282\u70B9\u90FD\u6709\u4E00\u4E2A\u552F\u4E00\u7684<code>id</code>\u5C5E\u6027\u3002</strong></p><p>\u60A8<code>id</code>\u5BF9<code>Movie</code>\u8282\u70B9\u7684\u5C5E\u6027\u521B\u5EFA\u7EA6\u675F\u4EE5\u786E\u4FDD\u5E26\u6709<code>Movie</code>\u6807\u7B7E\u7684\u8282\u70B9\u5C06\u5177\u6709\u552F\u4E00\u7684<code>id</code>\u5C5E\u6027\u3002</p><p>\u4F7F\u7528_Neo4j \u6D4F\u89C8\u5668_\uFF0C\u8FD0\u884C\u4EE5\u4E0B Cypher\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE CONSTRAINT movieIdConstraint FOR (movie:Movie) REQUIRE movie.id IS UNIQUE

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div>`,7),Fe={href:"https://neo4j.com/docs/operations-manual/4.4/tools/cypher-shell/#cypher-shell",target:"_blank",rel:"noopener noreferrer"},we=e("em",null,"Neo4j Cypher Shell",-1),Ve=s(`<p><strong>Shell</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>bin/cypher-shell --database=neo4j &quot;CREATE CONSTRAINT movieIdConstraint FOR (movie:Movie) REQUIRE movie.id IS UNIQUE&quot;

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p><strong>4.<code>Country</code>\u4E3A<code>name</code>\u5C5E\u6027\u521B\u5EFA\u8282\u70B9\u7D22\u5F15\u3002</strong></p><p>\u5728\u8282\u70B9\u7684<code>name</code>\u5C5E\u6027\u4E0A\u521B\u5EFA\u7D22\u5F15<code>Country</code>\u4EE5\u786E\u4FDD\u5FEB\u901F\u67E5\u627E\u3002</p>`,4),We=e("code",null,"MERGE",-1),ze=e("code",null,"MATCH",-1),Be=e("code",null,"LOAD CSV",-1),Ke={href:"https://neo4j.com/docs/getting-started/current/cypher-intro/schema/#cypher-intro-indexes",target:"_blank",rel:"noopener noreferrer"},Ze={href:"https://neo4j.com/docs/getting-started/current/cypher-intro/schema/#cypher-intro-constraints",target:"_blank",rel:"noopener noreferrer"},Qe=s(`<p>\u4F7F\u7528_Neo4j \u6D4F\u89C8\u5668_\uFF0C\u8FD0\u884C\u4EE5\u4E0B Cypher\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>CREATE INDEX FOR (c:Country) ON (c.name)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div>`,3),Ye={href:"https://neo4j.com/docs/operations-manual/4.4/tools/cypher-shell/#cypher-shell",target:"_blank",rel:"noopener noreferrer"},Xe=e("em",null,"Neo4j Cypher Shell",-1),Je=s(`<p><strong>Shell</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>bin/cypher-shell --database=neo4j &quot;CREATE INDEX FOR (c:Country) ON (c.name)&quot;

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><h4 id="_5-\u5BFC\u5165\u6570\u636E\u4F7F\u7528-load-csv" tabindex="-1"><a class="header-anchor" href="#_5-\u5BFC\u5165\u6570\u636E\u4F7F\u7528-load-csv" aria-hidden="true">#</a> 5.\u5BFC\u5165\u6570\u636E\u4F7F\u7528 <code>LOAD CSV</code></h4><p><strong>1. \u4ECE*persons.csv*\u6587\u4EF6\u52A0\u8F7D\u6570\u636E\u3002</strong></p><p>\u60A8\u521B\u5EFA\u5177\u6709<code>Person</code>\u6807\u7B7E\u548C\u5C5E\u6027\u7684\u8282\u70B9<code>id</code>\u4EE5\u53CA<code>name</code>\u3002</p><p>\u4F7F\u7528_Neo4j \u6D4F\u89C8\u5668_\uFF0C\u8FD0\u884C\u4EE5\u4E0B Cypher\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>LOAD CSV WITH HEADERS FROM &quot;file:///persons.csv&quot; AS csvLine
CREATE (p:Person {id: toInteger(csvLine.id), name: csvLine.name})

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div>`,8),$e={href:"https://neo4j.com/docs/operations-manual/4.4/tools/cypher-shell/#cypher-shell",target:"_blank",rel:"noopener noreferrer"},en=e("em",null,"Neo4j Cypher Shell",-1),nn=s(`<p><strong>Shell</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>bin/cypher-shell --database=neo4j &#39;LOAD CSV WITH HEADERS FROM &quot;file:///persons.csv&quot; AS csvLine CREATE (p:Person {id:toInteger(csvLine.id), name:csvLine.name})&#39;

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p><strong>Return</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Added 4 nodes, Set 8 properties, Added 4 labels

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div>`,4),dn=e("code",null,"LOAD CSV",-1),sn=e("code",null,"HTTPS",-1),rn=e("code",null,"HTTP",-1),an=e("code",null,"FTP",-1),on={href:"https://neo4j.com/docs/cypher-manual/4.4/clauses/load-csv/#query-load-csv",target:"_blank",rel:"noopener noreferrer"},ln=e("code",null,"LOAD CSV",-1),tn=s(`<p><strong>2. \u4ECE*movies.csv*\u6587\u4EF6\u52A0\u8F7D\u6570\u636E\u3002</strong></p><p>\u60A8\u53EF\u4EE5\u4F7F\u7528<code>Movie</code>\u6807\u7B7E\u548C\u5C5E\u6027<code>id</code>\u3001<code>title</code>\u3001 \u548C \u6765\u521B\u5EFA\u8282\u70B9<code>year</code>\u3002</p><p>\u60A8\u8FD8\u53EF\u4EE5\u4F7F\u7528<code>Country</code>\u6807\u7B7E\u521B\u5EFA\u8282\u70B9\u3002\u5728\u591A\u90E8\u7535\u5F71\u5177\u6709\u76F8\u540C\u539F\u4EA7\u56FD\u7684\u60C5\u51B5\u4E0B\uFF0C\u4F7F\u7528<code>MERGE</code>\u53EF\u907F\u514D\u521B\u5EFA\u91CD\u590D<code>Country</code>\u8282\u70B9\u3002</p><p>\u4E0E\u7C7B\u578B\u7684\u5173\u7CFB<code>ORIGIN</code>\u5C06\u8FDE\u63A5<code>Country</code>\u8282\u70B9\u548C<code>Movie</code>\u8282\u70B9\u3002</p><p>\u4F7F\u7528_Neo4j \u6D4F\u89C8\u5668_\uFF0C\u8FD0\u884C\u4EE5\u4E0B Cypher\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>LOAD CSV WITH HEADERS FROM &quot;file:///movies.csv&quot; AS csvLine
MERGE (country:Country {name: csvLine.country})
CREATE (movie:Movie {id: toInteger(csvLine.id), title: csvLine.title, year:toInteger(csvLine.year)})
CREATE (movie)-[:ORIGIN]-&gt;(country)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div>`,7),cn={href:"https://neo4j.com/docs/operations-manual/4.4/tools/cypher-shell/#cypher-shell",target:"_blank",rel:"noopener noreferrer"},pn=e("em",null,"Neo4j Cypher Shell",-1),vn=s(`<p><strong>Shell</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>bin/cypher-shell --database=neo4j &#39;LOAD CSV WITH HEADERS FROM &quot;file:///movies.csv&quot; AS csvLine MERGE (country:Country {name:csvLine.country}) CREATE (movie:Movie {id:toInteger(csvLine.id), title:csvLine.title, year:toInteger(csvLine.year)}) CREATE (movie)-[:ORIGIN]-&gt;(country)&#39;

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p><strong>Return</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Added 4 nodes, Created 3 relationships, Set 10 properties, Added 4 labels

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p><strong>3.\u4ECE*roles.csv*\u6587\u4EF6\u4E2D\u52A0\u8F7D\u6570\u636E</strong></p><p>\u4ECE_roles.csv_\u6587\u4EF6\u5BFC\u5165\u6570\u636E\u5C31\u662F\u627E\u5230<code>Person</code>\u8282\u70B9\u548C<code>Movie</code>\u8282\u70B9\uFF0C\u7136\u540E\u5728\u5B83\u4EEC\u4E4B\u95F4\u521B\u5EFA\u5173\u7CFB\u3002</p>`,6),un=e("code",null,"USING PERIODIC COMMIT",-1),mn=e("code",null,"LOAD CSV",-1),hn={href:"https://neo4j.com/docs/cypher-manual/4.4/query-tuning/using/#query-using-periodic-commit-hint",target:"_blank",rel:"noopener noreferrer"},bn=s(`<p>\u4F7F\u7528_Neo4j \u6D4F\u89C8\u5668_\uFF0C\u8FD0\u884C\u4EE5\u4E0B Cypher\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>USING PERIODIC COMMIT 500
LOAD CSV WITH HEADERS FROM &quot;file:///roles.csv&quot; AS csvLine
MATCH (person:Person {id: toInteger(csvLine.personId)}), (movie:Movie {id: toInteger(csvLine.movieId)})
CREATE (person)-[:ACTED_IN {role: csvLine.role}]-&gt;(movie)

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div>`,3),gn={href:"https://neo4j.com/docs/operations-manual/4.4/tools/cypher-shell/#cypher-shell",target:"_blank",rel:"noopener noreferrer"},_n=e("em",null,"Neo4j Cypher Shell",-1),xn=s(`<p><strong>Shell</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>bin/cypher-shell --database=neo4j &#39;USING PERIODIC COMMIT 500 LOAD CSV WITH HEADERS FROM &quot;file:///roles.csv&quot; AS csvLine MATCH (person:Person {id:toInteger(csvLine.personId)}), (movie:Movie {id:toInteger(csvLine.movieId)}) CREATE (person)-[:ACTED_IND {role:csvLine.role}]-&gt;(movie)&#39;

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p><strong>Return</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>Created 5 relationships, Set 5 properties

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><h4 id="_6-\u9A8C\u8BC1\u5BFC\u5165\u7684\u6570\u636E" tabindex="-1"><a class="header-anchor" href="#_6-\u9A8C\u8BC1\u5BFC\u5165\u7684\u6570\u636E" aria-hidden="true">#</a> 6. \u9A8C\u8BC1\u5BFC\u5165\u7684\u6570\u636E</h4><p>\u901A\u8FC7\u67E5\u627E\u6240\u6709\u5177\u6709\u5173\u7CFB\u7684\u8282\u70B9\u6765\u68C0\u67E5\u7ED3\u679C\u6570\u636E\u96C6\u3002</p><p>\u4F7F\u7528_Neo4j \u6D4F\u89C8\u5668_\uFF0C\u8FD0\u884C\u4EE5\u4E0B Cypher\uFF1A</p><p><strong>Cypher</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>MATCH (n)-[r]-&gt;(m) RETURN n, r, m

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div>`,9),En={href:"https://neo4j.com/docs/operations-manual/4.4/tools/cypher-shell/#cypher-shell",target:"_blank",rel:"noopener noreferrer"},Cn=e("em",null,"Neo4j Cypher Shell",-1),Tn=s(`<p><strong>Shell</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>bin/cypher-shell --database=neo4j &#39;MATCH (n)-[r]-&gt;(m) RETURN n, r, m&#39;

</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div></div></div><p><strong>Return</strong></p><div class="language-text ext-text line-numbers-mode"><pre class="language-text"><code>+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| n                                                               | r                                               | m                                                             |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:Movie {id: 3, title: &quot;The Shawshank Redemption&quot;, year: 1994}) | [:ORIGIN]                                       | (:Country {name: &quot;USA&quot;})                                      |
| (:Movie {id: 2, title: &quot;The American President&quot;, year: 1995})   | [:ORIGIN]                                       | (:Country {name: &quot;USA&quot;})                                      |
| (:Movie {id: 1, title: &quot;Wall Street&quot;, year: 1987})              | [:ORIGIN]                                       | (:Country {name: &quot;USA&quot;})                                      |
| (:Person {name: &quot;Morgan Freeman&quot;, id: 4})                       | [:ACTED_IN {role: &quot;Carl Fox&quot;}]                  | (:Movie {id: 1, title: &quot;Wall Street&quot;, year: 1987})            |
| (:Person {name: &quot;Charlie Sheen&quot;, id: 1})                        | [:ACTED_IN {role: &quot;Bud Fox&quot;}]                   | (:Movie {id: 1, title: &quot;Wall Street&quot;, year: 1987})            |
| (:Person {name: &quot;Martin Sheen&quot;, id: 3})                         | [:ACTED_IN {role: &quot;Gordon Gekko&quot;}]              | (:Movie {id: 1, title: &quot;Wall Street&quot;, year: 1987})            |
| (:Person {name: &quot;Martin Sheen&quot;, id: 3})                         | [:ACTED_IN {role: &quot;President Andrew Shepherd&quot;}] | (:Movie {id: 2, title: &quot;The American President&quot;, year: 1995}) |
| (:Person {name: &quot;Morgan Freeman&quot;, id: 4})                       | [:ACTED_IN {role: &quot;A.J. MacInerney&quot;}]           | (:Movie {id: 2, title: &quot;The American President&quot;, year: 1995}) |
+---------------------------------------------------------------------------------------------------------------
\u200B\`\`\`&lt;/neo4j-home&gt;
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div>`,4),Rn={href:"https://www.cnblogs.com/wheaesong/p/15649547.html#/c/subject/p/15649547.html",target:"_blank",rel:"noopener noreferrer"};function yn(An,Nn){const i=l("ExternalLinkIcon");return a(),o("div",null,[H,e("p",null,[n("\u672C\u6587\u8F6C\u81EA "),e("a",O,[n("https://www.cnblogs.com/wheaesong/p/15649547.html#/c/subject/p/15649547.html"),d(i)]),n("\uFF0C\u5982\u6709\u4FB5\u6743\uFF0C\u8BF7\u8054\u7CFB\u5220\u9664\u3002")]),P,e("p",null,[n("\u8BB8\u53EF\uFF1A"),e("a",q,[n("\u77E5\u8BC6\u5171\u4EAB 4.0"),d(i)])]),U,L,G,F,w,V,e("ul",null,[e("li",null,[e("a",W,[n("\u5F00\u59CB\u4F7F\u7528 Neo4j"),d(i)]),n(" \u2014 \u5982\u4F55\u5F00\u59CB\u4F7F\u7528 Neo4j\u3002")]),e("li",null,[e("a",z,[n("\u56FE\u6570\u636E\u5E93\u6982\u5FF5"),d(i)]),n("\u2009-"),e("a",B,[n("\u56FE\u6570\u636E\u5E93\u6982\u5FF5"),d(i)]),n("\u4ECB\u7ECD\u3002")]),e("li",null,[e("a",K,[n("Cypher"),d(i)]),n("\u2009\u7B80\u4ECB \u2014 \u56FE\u67E5\u8BE2\u8BED\u8A00 Cypher \u7B80\u4ECB\u3002")])]),Z,Q,Y,X,J,e("p",null,[n("\u8BBE\u7F6E\u4F7F\u7528 Neo4j \u548C Cypher \u5F00\u53D1\u5E94\u7528\u7A0B\u5E8F\u7684\u73AF\u5883\u7684\u6700\u7B80\u5355\u65B9\u6CD5\u662F\u4F7F\u7528 Neo4j Desktop\u3002\u4ECE"),e("a",$,[n("https://neo4j.com/download/\u4E0B\u8F7D"),d(i)]),n(" Neo4j Desktop\uFF0C\u7136\u540E\u6309\u7167\u60A8\u64CD\u4F5C\u7CFB\u7EDF\u7684\u5B89\u88C5\u8BF4\u660E\u8FDB\u884C\u64CD\u4F5C\u3002")]),e("p",null,[n("\u6709\u5173\u5982\u4F55\u5F00\u59CB\u4F7F\u7528 Neo4j \u548C Cypher \u7684\u66F4\u591A\u9009\u9879\uFF0C\u8BF7\u53C2\u9605"),e("a",ee,[n("https://neo4j.com/try-neo4j/\u3002"),d(i)])]),ne,e("p",null,[n("\u6240\u6709\u5B98\u65B9\u6587\u6863\u90FD\u53EF\u4EE5\u5728"),e("a",ie,[n("https://neo4j.com/docs/ \u83B7\u5F97"),d(i)]),n("\u3002")]),de,e("ul",null,[e("li",null,[e("a",se,[n("Cypher \u624B\u518C"),d(i)]),n("\u2009\u2014 \u8FD9\u662F Cypher \u7684\u7EFC\u5408\u624B\u518C\u3002")]),e("li",null,[e("a",re,[n("\u64CD\u4F5C\u624B\u518C"),d(i)]),n("\u2009\u2014\u2014\u672C\u624B\u518C\u63CF\u8FF0\u4E86\u5982\u4F55\u90E8\u7F72\u548C\u7EF4\u62A4 Neo4j\u3002")])]),e("p",null,[n("The "),e("a",ae,[n("Cypher Refcard"),d(i)]),n(" \u662F\u5B66\u4E60\u548C\u7F16\u5199 Cypher \u65F6\u7684\u5B9D\u8D35\u513F\u51C6\u786E\u7684\u8D44\u6599")]),oe,e("p",null,[n("\u6709\u5173\u53EF\u7528\u6570\u636E\u7C7B\u578B\u7684\u8BE6\u7EC6\u8BF4\u660E\uFF0C\u8BF7\u53C2\u9605"),e("a",le,[n("Cypher \u624B\u518C \u2192 \u503C\u548C\u7C7B\u578B"),d(i)]),n("\u3002")]),te,e("p",null,[n("\u7D22\u5F15\u7528\u4E8E\u63D0\u9AD8\u6027\u80FD\u3002\u8981\u67E5\u770B\u5982\u4F55"),e("a",ce,[n("\u4F7F\u7528\u7D22\u5F15\u7684"),d(i)]),n("\u793A\u4F8B\uFF0C\u8BF7\u53C2\u9605"),e("a",pe,[n("\u4F7F\u7528\u7D22\u5F15"),d(i)]),n("\u3002\u6709\u5173\u5982\u4F55\u5728 Cypher \u4E2D\u4F7F\u7528\u7D22\u5F15\u7684\u8BE6\u7EC6\u8BF4\u660E\uFF0C\u8BF7\u53C2\u9605"),e("a",ve,[n("Cypher \u624B\u518C \u2192 \u7D22\u5F15"),d(i)]),n("\u3002")]),ue,e("p",null,[n("\u7EA6\u675F\u7528\u4E8E\u786E\u4FDD\u6570\u636E\u7B26\u5408\u57DF\u7684\u89C4\u5219\u3002\u8981\u67E5\u770B\u5982\u4F55"),e("a",me,[n("\u4F7F\u7528\u7EA6\u675F\u7684"),d(i)]),n("\u793A\u4F8B\uFF0C\u8BF7\u53C2\u9605"),e("a",he,[n("\u4F7F\u7528\u7EA6\u675F"),d(i)]),n("\u3002\u6709\u5173\u5982\u4F55\u5728 Cypher \u4E2D\u4F7F\u7528\u7EA6\u675F\u7684\u8BE6\u7EC6\u8BF4\u660E\uFF0C\u8BF7\u53C2\u9605"),e("a",be,[n("Cypher \u624B\u518C \u2192 \u7EA6\u675F"),d(i)]),n("\u3002")]),ge,e("p",null,[n("\u5177\u4F53\u7684\u547D\u540D\u89C4\u5219\u8BF7\u53C2\u8003"),e("a",_e,[n("Cypher \u624B\u518C\u2192\u547D\u540D\u89C4\u5219\u548C\u5EFA\u8BAE"),d(i)]),n("\u3002")]),xe,Ee,e("p",null,[n("\u6709\u5173 Cypher \u7684\u5B8C\u6574\u53C2\u8003\uFF0C\u8BF7\u53C2\u9605"),e("a",Ce,[n("Cypher \u624B\u518C"),d(i)]),n("\u3002")]),Te,e("p",null,[n("\u53EF\u4EE5\u4F7F\u7528_\u7D22\u5F15\u63D0\u793A_\u6307\u5B9A\u5728\u7279\u5B9A\u67E5\u8BE2\u4E2D\u4F7F\u7528\u54EA\u4E2A\u7D22\u5F15\u3002\u8FD9\u662F\u67E5\u8BE2\u8C03\u4F18\u7684\u51E0\u4E2A\u9009\u9879\u4E4B\u4E00\uFF0C\u5728"),e("a",Re,[n("Cypher \u624B\u518C \u2192 \u67E5\u8BE2\u8C03\u4F18"),d(i)]),n("\u4E2D\u6709\u8BE6\u7EC6\u63CF\u8FF0\u3002")]),ye,e("p",null,[n("\u5728"),e("a",Ae,[n("Cypher Manual \u2192 Indexes \u4E2D"),d(i)]),n("\u4E86\u89E3\u6709\u5173\u7D22\u5F15\u7684\u66F4\u591A\u4FE1\u606F\u3002")]),Ne,e("p",null,[n("\u5728"),e("a",fe,[n("Cypher \u624B\u518C \u2192 \u7EA6\u675F\u4E2D"),d(i)]),n("\u4E86\u89E3\u6709\u5173\u7EA6\u675F\u7684\u66F4\u591A\u4FE1\u606F\u3002")]),Ie,e("p",null,[n("\u6709\u5173 \u7684\u5B8C\u6574\u8BF4\u660E"),Me,n("\uFF0C\u8BF7\u53C2\u9605"),e("a",Se,[n("Cypher \u624B\u518C \u2192"),je,d(i)]),n("\u3002\u6709\u5173 Cypher \u5B50\u53E5\u7684\u5B8C\u6574\u5217\u8868\uFF0C\u8BF7\u53C2\u9605"),e("a",De,[n("Cypher \u624B\u518C \u2192 \u5B50\u53E5"),d(i)]),n("\u3002")]),ke,e("p",null,[n("\u6709\u5173\u5176\u4ED6\u5B89\u88C5\u7684\u9ED8\u8BA4\u76EE\u5F55\uFF0C\u8BF7\u53C2\u9605"),e("a",He,[n("\u64CD\u4F5C\u624B\u518C \u2192 \u6587\u4EF6\u4F4D\u7F6E"),d(i)]),n("\u3002\u5BFC\u5165\u4F4D\u7F6E\u53EF\u901A\u8FC7"),e("a",Oe,[n("\u64CD\u4F5C\u624B\u518C \u2192"),Pe,d(i)]),n("\u8FDB\u884C\u914D\u7F6E\u3002")]),qe,e("p",null,[n("\u6216\u8005\u4F7F\u7528"),e("a",Ue,[Le,d(i)]),n("\uFF0C\u8FD0\u884C\u547D\u4EE4\uFF1A")]),Ge,e("p",null,[n("\u6216\u8005\u4F7F\u7528"),e("a",Fe,[we,d(i)]),n("\uFF0C\u8FD0\u884C\u547D\u4EE4\uFF1A")]),Ve,e("p",null,[n("\u4F7F\u7528"),We,n("\u6216"),ze,n("with \u65F6"),Be,n("\uFF0C\u8BF7\u786E\u4FDD\u5BF9\u8981\u5408\u5E76\u7684\u5C5E\u6027\u5177\u6709"),e("a",Ke,[n("\u7D22\u5F15"),d(i)]),n("\u6216"),e("a",Ze,[n("\u552F\u4E00\u7EA6\u675F"),d(i)]),n("\u3002\u8FD9\u5C06\u786E\u4FDD\u67E5\u8BE2\u4EE5\u9AD8\u6027\u80FD\u65B9\u5F0F\u6267\u884C\u3002")]),Qe,e("p",null,[n("\u6216\u8005\u4F7F\u7528"),e("a",Ye,[Xe,d(i)]),n("\uFF0C\u8FD0\u884C\u547D\u4EE4\uFF1A")]),Je,e("p",null,[n("\u6216\u8005\u4F7F\u7528"),e("a",$e,[en,d(i)]),n("\uFF0C\u8FD0\u884C\u547D\u4EE4\uFF1A")]),nn,e("p",null,[dn,n("\u8FD8\u652F\u6301\u901A\u8FC7"),sn,n("\u3001"),rn,n("\u548C\u8BBF\u95EE CSV \u6587\u4EF6"),an,n("\uFF0C\u8BF7\u53C2\u9605"),e("a",on,[n("\u5BC6\u7801\u624B\u518C \u2192"),ln,d(i)]),n("\u3002")]),tn,e("p",null,[n("\u6216\u8005\u4F7F\u7528"),e("a",cn,[pn,d(i)]),n("\uFF0C\u8FD0\u884C\u547D\u4EE4\uFF1A")]),vn,e("p",null,[n("\u5BF9\u4E8E\u8F83\u5927\u7684\u6570\u636E\u6587\u4EF6\uFF0C\u5B83\u662F\u4F7F\u7528\u63D0\u793A\u6709\u7528"),un,n("\u7684\u6761\u6B3E"),mn,n("\u3002\u8FD9\u4E2A\u63D0\u793A\u544A\u8BC9 Neo4j \u67E5\u8BE2\u53EF\u80FD\u4F1A\u5EFA\u7ACB\u8FC7\u591A\u7684\u4E8B\u52A1\u72B6\u6001\uFF0C\u56E0\u6B64\u9700\u8981\u5B9A\u671F\u63D0\u4EA4\u3002\u6709\u5173\u66F4\u591A\u4FE1\u606F\uFF0C\u8BF7\u53C2\u9605"),e("a",hn,[n("4.4@cypher-manual:ROOT:query-tuning/using/index.adoc#query-using-periodic-commit-hint"),d(i)]),n("\u3002")]),bn,e("p",null,[n("\u6216\u8005\u4F7F\u7528"),e("a",gn,[_n,d(i)]),n("\uFF0C\u8FD0\u884C\u547D\u4EE4\uFF1A")]),xn,e("p",null,[n("\u6216\u8005\u4F7F\u7528"),e("a",En,[Cn,d(i)]),n("\uFF0C\u8FD0\u884C\u547D\u4EE4\uFF1A")]),Tn,e("p",null,[n("\u672C\u6587\u8F6C\u81EA "),e("a",Rn,[n("https://www.cnblogs.com/wheaesong/p/15649547.html#/c/subject/p/15649547.html"),d(i)]),n("\uFF0C\u5982\u6709\u4FB5\u6743\uFF0C\u8BF7\u8054\u7CFB\u5220\u9664\u3002")])])}const Mn=r(k,[["render",yn],["__file","neo4j.html.vue"]]);export{Mn as default};
